intro_ocaml.org
#+title:  Introduction to OCaml
#+date: 20200109
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

* Preamble

  This intro is partial ;-)

* Introduction

** The *Categorical Abstract Machine Language*

   OCaml is part of the ML family, like SML (big brother) or F# (little brother).

   - 1973 :: ML

     Check the foundations from http://www.nuprl.org/software/eventml/KreitzandRahli-ClassicML.pdf
   - 1987-1992 :: Heavy CAML (LISP-based implementation)
   - 1990-1991 :: Caml Light
   - 1996 :: Objective Caml 1.00
   - 2011 :: Rebranding to OCaml (not O'Caml, not oCaml, ~Just OCaml~)
   - 2019 :: OCaml 4.09

** OCaml : an open-minded functional language

   It is *not* a purely functional language: imperative programming is part of
   the nominal toolbox, even OOP when it is the right fit.

   The standard lib has been kept voluntarily small.

   There have been various efforts to provide "batteries".


** Bytecode and native code support

   2 compilers for the price of one:
   1. a bytecode compiler (~ocamlc~) to a stack-based VM, and its interpreter ~ocamlrun~
      works anywhere you have a C compiler
   2. a native code compiler (~ocamlopt~)
      - supports x86 (32/64), ARM (v5-v8), PowerPC(32/64) and ... SPARC !
      - RISC-V not yet integrated but support exists



** Users

   - (Mostly French) academic circles
     - academia :: INRIA, CEA, CMU, UPenn, Berkeley, UArizona
     - SMEs :: OCamlPro/Origin Labs, Nomadic Labs, TrustInSoft, Tarides,
   - Financial "institutions" -- Jane Street, Bloomberg, SimCorp, Lexifi
   - Facebook (ReasonML, Infer)
   - Atos, AbsInt
   - Indirectly Airbus (Astrée, Frama-C, Fluctuat), EDF


*** Domains

    - compilers
    - program analysis
    - theorem proving
    - symbolic computations


** Tooling (as of )

   - the [[https://github.com/ocaml/ocaml][compiler]] :: last release is 4.09 (2019-09-18)
   - [[https://github.com/ocaml/merlin][merlin]] :: context-sensitive completion for OCaml (in Vim & Emacs)

        A *very* nice tool which has changed the life of most OCaml developers,
        and it's editor-agnostic !
   - [[https://github.com/ocaml/dune][dune]] :: the newest contender in dedicated build systems

     May OCamlMakefile, omake, ocamlbuild rest in peace.

   - [[https://github.com/ocaml/opam][OPAM]] (v1.0 in 2013) :: current is 2.5 (2019-07-11)

        A source-based package manager for OCaml software.
   - Emacs


   Check out
   - https://opam.ocaml.org/blog/turn-your-editor-into-an-ocaml-ide/



* Syntax Basics?

** let-bindings

   #+begin_src ocaml
     let x = Pervasives.read_int () in
     let y = Pervasives.read_int () in
     Pervasives.print_int (x + y);
     Pervasives.print_newline ()
     ;;
   #+end_src

** Functions

   #+begin_src ocaml
     let add x y =
       x + y
     ;;
   #+end_src

   Since we are in a so-called functional languages, let's talk about functions.

   Functions are *curried* (unlike SML functions).

   That means ~add x y~ actually is ~add(x)(y)~ and ~add~ can be partially
   applied (or ~add x~).

   #+begin_src ocaml
     let add1 = add 1 ;;

     add1 2 ;;
   #+end_src


