intro_ocaml.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-08 Wed 16:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to OCaml</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Richard Bonichon" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Introduction to OCaml</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org83af78d">1. Preamble</a></li>
<li><a href="#org6aaef40">2. Introduction</a>
<ul>
<li><a href="#org912a9e2">2.1. The <b>Categorical Abstract Machine Language</b></a></li>
<li><a href="#org520d741">2.2. OCaml : an open-minded functional language</a></li>
<li><a href="#org7629583">2.3. Bytecode and native code support</a></li>
<li><a href="#orga14064a">2.4. Users</a>
<ul>
<li><a href="#org492f0ec">2.4.1. Domains</a></li>
</ul>
</li>
<li><a href="#org23975ad">2.5. Tooling (as of )</a></li>
</ul>
</li>
<li><a href="#orgfd7910a">3. Syntax Basics?</a>
<ul>
<li><a href="#org093952e">3.1. let-bindings</a></li>
<li><a href="#org148adfa">3.2. Functions</a></li>
<li><a href="#org8401ef6">3.3. Recursivity</a></li>
<li><a href="#orgcd1b2e9">3.4. Functions are first-class citizens</a></li>
<li><a href="#org882594d">3.5. Evaluation is strict</a>
<ul>
<li><a href="#org472037b">3.5.1. Oddity</a></li>
</ul>
</li>
<li><a href="#orgb1ac9b7">3.6. Grouping information : Tuples</a></li>
<li><a href="#org3d54db2">3.7. Everything is a pattern</a></li>
<li><a href="#org8791940">3.8. Grouping information : Records (aka named tuples)</a></li>
<li><a href="#orgf73df03">3.9. ADT &amp; pattern matching</a></li>
<li><a href="#org99f1ef2">3.10. Labels (aka named arguments)</a></li>
<li><a href="#orga99a2b1">3.11. Optional arguments</a></li>
<li><a href="#org5377c4d">3.12. Optional arguments <b>are</b> option types</a></li>
<li><a href="#orgcee7adf">3.13. Using named arguments in practice</a></li>
<li><a href="#org54d3953">3.14. Nice to have: type-directed record disambiguation</a></li>
</ul>
</li>
<li><a href="#orgfb4a9fc">4. Imperative programming</a>
<ul>
<li><a href="#orgc008e66">4.1. It's ok to be impure</a></li>
<li><a href="#orgd92931e">4.2. The unit type</a></li>
<li><a href="#org18f8421">4.3. Trivia :: What's in a reference?</a></li>
<li><a href="#org826d880">4.4. Typical OCaml code</a></li>
<li><a href="#org713f781">4.5. Trivia :: Hashtables</a></li>
<li><a href="#org6c347aa">4.6. Pitfall(s)</a></li>
<li><a href="#org9c22793">4.7. Exceptions</a></li>
<li><a href="#org17a937f">4.8. Local exceptions &amp; pattern-matching mixed exceptions/values</a></li>
</ul>
</li>
<li><a href="#orgc93a7a1">5. More advanced topics</a>
<ul>
<li><a href="#org9d06255">5.1. What's a module?</a></li>
<li><a href="#org20fbbee">5.2. Interface &amp; implementation :: <code>mli</code> &amp; <code>ml</code></a></li>
<li><a href="#org2fa5789">5.3. Levels of type abstraction</a>
<ul>
<li><a href="#org0484cee">5.3.1. Open</a></li>
<li><a href="#orga57eb7c">5.3.2. private</a></li>
<li><a href="#orga570af2">5.3.3. abstract</a></li>
</ul>
</li>
<li><a href="#org1e91653">5.4. Genericity</a>
<ul>
<li><a href="#org05ecbe4">5.4.1. Ad-hoc polymorphism</a></li>
<li><a href="#org06f8eea">5.4.2. Functors (module generator)</a></li>
</ul>
</li>
<li><a href="#orga9cb9d2">5.5. First-order modules</a>
<ul>
<li><a href="#org2b4f2a8">5.5.1. More involved example</a></li>
</ul>
</li>
<li><a href="#org8ba4ffd">5.6. Monadic style programming</a></li>
<li><a href="#org7f04004">5.7. GADTs</a></li>
<li><a href="#org8cdfb5a">5.8. Death by GADTs</a></li>
<li><a href="#org55d1d8d">5.9. <code>Format</code>'ing text</a></li>
<li><a href="#orga7427fe">5.10. Things that I did not talk about</a></li>
</ul>
</li>
<li><a href="#orgbe525c6">6. Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-org83af78d" class="outline-2">
<h2 id="org83af78d"><span class="section-number-2">1</span> Preamble</h2>
<div class="outline-text-2" id="text-1">
<p>
This intro is partial ;-)
</p>
</div>
</div>

<div id="outline-container-org6aaef40" class="outline-2">
<h2 id="org6aaef40"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org912a9e2" class="outline-3">
<h3 id="org912a9e2"><span class="section-number-3">2.1</span> The <b>Categorical Abstract Machine Language</b></h3>
<div class="outline-text-3" id="text-2-1">
<p>
OCaml is part of the ML family, like SML (big brother) or F# (little brother).
</p>

<dl class="org-dl">
<dt>1973</dt><dd><p>
ML
</p>

<p>
Check the foundations from <a href="http://www.nuprl.org/software/eventml/KreitzandRahli-ClassicML.pdf">http://www.nuprl.org/software/eventml/KreitzandRahli-ClassicML.pdf</a>
</p></dd>
<dt>1987-1992</dt><dd>Heavy CAML (LISP-based implementation)</dd>
<dt>1990-1991</dt><dd>Caml Light</dd>
<dt>1996</dt><dd>Objective Caml 1.00</dd>
<dt>2011</dt><dd>Rebranding to OCaml (not O'Caml, not oCaml, <code>Just OCaml</code>)</dd>
<dt>2019</dt><dd>OCaml 4.09</dd>
</dl>
</div>
</div>

<div id="outline-container-org520d741" class="outline-3">
<h3 id="org520d741"><span class="section-number-3">2.2</span> OCaml : an open-minded functional language</h3>
<div class="outline-text-3" id="text-2-2">
<p>
It is <b>not</b> a purely functional language: imperative programming is part of
the nominal toolbox, even OOP when it is the right fit.
</p>

<p>
The standard lib has been kept voluntarily small.
</p>

<p>
There have been various efforts to provide "batteries".
</p>
</div>
</div>


<div id="outline-container-org7629583" class="outline-3">
<h3 id="org7629583"><span class="section-number-3">2.3</span> Bytecode and native code support</h3>
<div class="outline-text-3" id="text-2-3">
<p>
2 compilers for the price of one:
</p>
<ol class="org-ol">
<li>a bytecode compiler (<code>ocamlc</code>) to a stack-based VM, and its interpreter <code>ocamlrun</code>
works anywhere you have a C compiler</li>
<li>a native code compiler (<code>ocamlopt</code>)
<ul class="org-ul">
<li>supports x86 (32/64), ARM (v5-v8), PowerPC(32/64) and &#x2026; SPARC !</li>
<li>RISC-V not yet integrated but support exists</li>
</ul></li>
</ol>
</div>
</div>



<div id="outline-container-orga14064a" class="outline-3">
<h3 id="orga14064a"><span class="section-number-3">2.4</span> Users</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>(Mostly French) academic circles
<dl class="org-dl">
<dt>academia</dt><dd>INRIA, CEA, CMU, UPenn, Berkeley, UArizona</dd>
<dt>SMEs</dt><dd>OCamlPro/Origin Labs, Nomadic Labs, TrustInSoft, Tarides,</dd>
</dl></li>
<li>Financial "institutions" &#x2013; Jane Street, Bloomberg, SimCorp, Lexifi</li>
<li>Facebook (ReasonML, Infer)</li>
<li>Atos, AbsInt</li>
<li>Indirectly Airbus (Astrée, Frama-C, Fluctuat), EDF</li>
</ul>
</div>


<div id="outline-container-org492f0ec" class="outline-4">
<h4 id="org492f0ec"><span class="section-number-4">2.4.1</span> Domains</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>compilers</li>
<li>program analysis</li>
<li>theorem proving</li>
<li>symbolic computations</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org23975ad" class="outline-3">
<h3 id="org23975ad"><span class="section-number-3">2.5</span> Tooling (as of )</h3>
<div class="outline-text-3" id="text-2-5">
<dl class="org-dl">
<dt>the <a href="https://github.com/ocaml/ocaml">compiler</a></dt><dd>last release is 4.09 (2019-09-18)</dd>
<dt><a href="https://github.com/ocaml/merlin">merlin</a></dt><dd><p>
context-sensitive completion for OCaml (in Vim &amp; Emacs)
</p>

<p>
A <b>very</b> nice tool which has changed the life of most OCaml developers,
and it's editor-agnostic !
</p></dd>
<dt><a href="https://github.com/ocaml/dune">dune</a></dt><dd><p>
the newest contender in dedicated build systems
</p>

<p>
May OCamlMakefile, omake, ocamlbuild rest in peace.
</p></dd>

<dt><a href="https://github.com/ocaml/opam">OPAM</a> (v1.0 in 2013)</dt><dd><p>
current is 2.5 (2019-07-11)
</p>

<p>
A source-based package manager for OCaml software.
</p></dd>
<dt>(no term)</dt><dd>Emacs</dd>
</dl>


<p>
Check out
</p>
<ul class="org-ul">
<li><a href="https://opam.ocaml.org/blog/turn-your-editor-into-an-ocaml-ide/">https://opam.ocaml.org/blog/turn-your-editor-into-an-ocaml-ide/</a></li>
</ul>
</div>
</div>
</div>



<div id="outline-container-orgfd7910a" class="outline-2">
<h2 id="orgfd7910a"><span class="section-number-2">3</span> Syntax Basics?</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org093952e" class="outline-3">
<h3 id="org093952e"><span class="section-number-3">3.1</span> let-bindings</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #9b59b6;">x</span> = <span style="color: #2492db; font-weight: bold;">Pervasives.</span>read_int <span style="color: #7f8c8d;">()</span> <span style="color: #34495e;">in</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">y</span> = <span style="color: #2492db; font-weight: bold;">Pervasives.</span>read_int <span style="color: #7f8c8d;">()</span> <span style="color: #34495e;">in</span>
<span style="color: #2492db; font-weight: bold;">Pervasives.</span>print_int <span style="color: #7f8c8d;">(</span>x + y<span style="color: #7f8c8d;">)</span>;
<span style="color: #2492db; font-weight: bold;">Pervasives.</span>print_newline <span style="color: #7f8c8d;">()</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org148adfa" class="outline-3">
<h3 id="org148adfa"><span class="section-number-3">3.2</span> Functions</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">add</span> <span style="color: #9b59b6;">x</span> <span style="color: #9b59b6;">y</span> =
  x + y
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
Since we are in a so-called functional languages, let's talk about functions.
</p>

<p>
Functions are <b>curried</b> (unlike SML functions).
</p>

<p>
That means <code>add x y</code> actually is <code>add(x)(y)</code> and <code>add</code> can be partially
applied (or <code>add x</code>).
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #9b59b6;">add1</span> = add 1 <span style="color: #ff4500;">;;</span>

add1 2 <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
