intro_ocaml.org
** Recursivity

   Recursive functions are explicitly qualified by the *rec* keyword.

   #+begin_src ocaml
     let rec fact n =
       if n < 2 then 1 else n * fact (n - 1)
     ;;

     let rec foldl f acc = function
       | [] -> acc
       | x :: xs -> foldl f (f acc x) xs
     ;;

     foldl (+) 0 [1;2;3;4] ;; (* 10 \o/ *)
   #+end_src

   Functions are not recursive by default.

   #+begin_src ocaml
     (* This second declaration hides the first.*)
     let fact n = assert (n >= 0); fact n
   #+end_src



** Functions are first-class citizens

   #+begin_src ocaml
     (* [max cmp l] computes the maximun element of a list [l] provided a [cmp]
      ,* function which is expected to conform to the following specification:
      ,* - cmp x y = 0 if x is equivalent to y
      ,* - cmp x y > 0 if x is bigger than y
      ,* - cmp x y < 0 if x if smaller than y
      ,*)
     let max cmp l =
       let rec aux cur_max l =
         match l with
         | [] -> cur_max
         | x :: xs ->
            let cur_max' =
              match cur_max with
              | None -> Some x
              | Some vmax -> if cmp x vmax > 0 then Some x else cur_max in
            aux cur_max' xs
       in aux None l
     ;;

     max Pervasives.compare [1; 2; 3;] ;;

     (* Oopsie, we just rewrote the [Pervasives.max] function !*)
     Pervasives.max ;;
   #+end_src

** Evaluation is strict

   Like in most programming languages ;-)

   #+begin_src ocaml
     let double x = 2 * x ;;

     let dadd x y =
       let x' = double x
       and y' = double y in
       ( + ) x' y'
       (* Infix operators are prefixed ones that are treated specially by the parser.
          Have fun and create your owns. *)
      ;;

     dadd (double 1) (double 2) ;;
   #+end_src

   ... well except for binary Boolean operators -- of course ;-).

*** Oddity

    Evaluation order for function arguments is *unspecified*.

    It is usually left-to-right, though.


** Grouping information : Tuples

    #+begin_src ocaml
    let a = 1, 2 in
    let x, y = a in
    x + y
    ;;
    #+end_src

    can also be written with ~( .. )~ as

    #+begin_src ocaml
    let a = (1, 2) in
    let (x, y) = a in
    x + y
    ;;
    #+end_src



** Everything is a pattern

   #+begin_src ocaml
     type point_3d = float * float * float

     let create x y z = x, y, z ;;

     (* Yes, FP arithmetic operations have a dedicated syntax *)
     let square a = a *. a ;;

     let dist (x1, y1, z1) p =
       let x2, y2, z2 = p in
       let xdiff = x2 -. x1
       and ydiff = y2 -. y1
       and zdiff = z2 -. z1 in
       square xdiff +. square ydiff +. square zdiff
       |> sqrt
     ;;

     let dist p1 p2 =
       match p1, p2 with
       (* The | can also be used as a separator instead of as a starting
          annotation. *)
       | (x1, y1, z1), (x2, y2, z2) ->
          let xdiff = x2 -. x1
          and ydiff = y2 -. y1
          and zdiff = z2 -. z1 in
          sqrt (square xdiff +. square ydiff +. square zdiff)
     ;;
   #+end_src

