intro_ocaml.html


<div id="outline-container-org8401ef6" class="outline-3">
<h3 id="org8401ef6"><span class="section-number-3">3.3</span> Recursivity</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Recursive functions are explicitly qualified by the <b>rec</b> keyword.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">fact</span> <span style="color: #9b59b6;">n</span> =
  <span style="color: #2980b9;">if</span> n &lt; 2 <span style="color: #2980b9;">then</span> 1 <span style="color: #2980b9;">else</span> n * fact <span style="color: #7f8c8d;">(</span>n - 1<span style="color: #7f8c8d;">)</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">foldl</span> <span style="color: #9b59b6;">f</span> <span style="color: #9b59b6;">acc</span> = <span style="color: #2980b9;">function</span>
  | <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span> -&gt; acc
  | x <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> xs -&gt; foldl f <span style="color: #7f8c8d;">(</span>f acc x<span style="color: #7f8c8d;">)</span> xs
<span style="color: #ff4500;">;;</span>

foldl <span style="color: #7f8c8d;">(</span><span style="color: #8e44ad; font-weight: bold;">+</span><span style="color: #7f8c8d;">)</span> 0 <span style="color: #7f8c8d;">[</span>1;2;3;4<span style="color: #7f8c8d;">]</span> <span style="color: #ff4500;">;;</span> <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">10 \o/ </span><span style="color: #95a5a6;">*)</span>
</pre>
</div>

<p>
Functions are not recursive by default.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">This second declaration hides the first.</span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">fact</span> <span style="color: #9b59b6;">n</span> = <span style="color: #2980b9;">assert</span> <span style="color: #7f8c8d;">(</span>n &gt;= 0<span style="color: #7f8c8d;">)</span>; fact n
</pre>
</div>
</div>
</div>



<div id="outline-container-orgcd1b2e9" class="outline-3">
<h3 id="orgcd1b2e9"><span class="section-number-3">3.4</span> Functions are first-class citizens</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">[max cmp l] computes the maximun element of a list [l] provided a [cmp]</span>
<span style="color: #95a5a6; font-style: italic;"> * function which is expected to conform to the following specification:</span>
<span style="color: #95a5a6; font-style: italic;"> * - cmp x y = 0 if x is equivalent to y</span>
<span style="color: #95a5a6; font-style: italic;"> * - cmp x y &gt; 0 if x is bigger than y</span>
<span style="color: #95a5a6; font-style: italic;"> * - cmp x y &lt; 0 if x if smaller than y</span>
<span style="color: #95a5a6; font-style: italic;"> </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">max</span> <span style="color: #9b59b6;">cmp</span> <span style="color: #9b59b6;">l</span> =
  <span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">aux</span> <span style="color: #9b59b6;">cur_max</span> <span style="color: #9b59b6;">l</span> =
    <span style="color: #2980b9;">match</span> l <span style="color: #2980b9;">with</span>
    | <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span> -&gt; cur_max
    | x <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> xs -&gt;
       <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">cur_max'</span> =
         <span style="color: #2980b9;">match</span> cur_max <span style="color: #2980b9;">with</span>
         | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">None</span> -&gt; <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Some</span> x
         | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Some</span> vmax -&gt; <span style="color: #2980b9;">if</span> cmp x vmax &gt; 0 <span style="color: #2980b9;">then</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Some</span> x <span style="color: #2980b9;">else</span> cur_max <span style="color: #34495e;">in</span>
       aux cur_max' xs
  <span style="color: #34495e;">in</span> aux <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">None</span> l
<span style="color: #ff4500;">;;</span>

max <span style="color: #2492db; font-weight: bold;">Pervasives.</span>compare <span style="color: #7f8c8d;">[</span>1; 2; 3;<span style="color: #7f8c8d;">]</span> <span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Oopsie, we just rewrote the [Pervasives.max] function !</span><span style="color: #95a5a6;">*)</span>
<span style="color: #2492db; font-weight: bold;">Pervasives.</span>max <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org882594d" class="outline-3">
<h3 id="org882594d"><span class="section-number-3">3.5</span> Evaluation is strict</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Like in most programming languages ;-)
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">double</span> <span style="color: #9b59b6;">x</span> = 2 * x <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">dadd</span> <span style="color: #9b59b6;">x</span> <span style="color: #9b59b6;">y</span> =
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">x'</span> = double x
  <span style="color: #34495e;">and</span> <span style="color: #9b59b6;">y'</span> = double y <span style="color: #34495e;">in</span>
  <span style="color: #7f8c8d;">(</span> <span style="color: #8e44ad; font-weight: bold;">+</span> <span style="color: #7f8c8d;">)</span> x' y'
  <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Infix operators are prefixed ones that are treated specially by the parser.</span>
<span style="color: #95a5a6; font-style: italic;">     Have fun and create your owns. </span><span style="color: #95a5a6;">*)</span>
 <span style="color: #ff4500;">;;</span>

dadd <span style="color: #7f8c8d;">(</span>double 1<span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span>double 2<span style="color: #7f8c8d;">)</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
&#x2026; well except for binary Boolean operators &#x2013; of course ;-).
</p>
</div>

<div id="outline-container-org472037b" class="outline-4">
<h4 id="org472037b"><span class="section-number-4">3.5.1</span> Oddity</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Evaluation order for function arguments is <b>unspecified</b>.
</p>

<p>
It is usually left-to-right, though.
</p>
</div>
</div>
</div>


<div id="outline-container-orgb1ac9b7" class="outline-3">
<h3 id="orgb1ac9b7"><span class="section-number-3">3.6</span> Grouping information : Tuples</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #9b59b6;">a</span> = 1, 2 <span style="color: #34495e;">in</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">x</span>, <span style="color: #9b59b6;">y</span> = a <span style="color: #34495e;">in</span>
x + y
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
can also be written with <code>( .. )</code> as
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #9b59b6;">a</span> = <span style="color: #7f8c8d;">(</span>1, 2<span style="color: #7f8c8d;">)</span> <span style="color: #34495e;">in</span>
<span style="color: #34495e;">let</span> <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">x</span>, <span style="color: #9b59b6;">y</span><span style="color: #7f8c8d;">)</span> = a <span style="color: #34495e;">in</span>
x + y
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-org3d54db2" class="outline-3">
<h3 id="org3d54db2"><span class="section-number-3">3.7</span> Everything is a pattern</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #9b59b6;">point_3d</span> = float * float * float

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">create</span> <span style="color: #9b59b6;">x</span> <span style="color: #9b59b6;">y</span> <span style="color: #9b59b6;">z</span> = x, y, z <span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Yes, FP arithmetic operations have a dedicated syntax </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">square</span> <span style="color: #9b59b6;">a</span> = a *. a <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">dist</span> <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">x1</span>, <span style="color: #9b59b6;">y1</span>, <span style="color: #9b59b6;">z1</span><span style="color: #7f8c8d;">)</span> <span style="color: #9b59b6;">p</span> =
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">x2</span>, <span style="color: #9b59b6;">y2</span>, <span style="color: #9b59b6;">z2</span> = p <span style="color: #34495e;">in</span>
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">xdiff</span> = x2 -. x1
  <span style="color: #34495e;">and</span> <span style="color: #9b59b6;">ydiff</span> = y2 -. y1
  <span style="color: #34495e;">and</span> <span style="color: #9b59b6;">zdiff</span> = z2 -. z1 <span style="color: #34495e;">in</span>
  square xdiff +. square ydiff +. square zdiff
  <span style="color: #c0392b;">|&gt;</span> sqrt
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">dist</span> <span style="color: #9b59b6;">p1</span> <span style="color: #9b59b6;">p2</span> =
  <span style="color: #2980b9;">match</span> p1, p2 <span style="color: #2980b9;">with</span>
  <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">The | can also be used as a separator instead of as a starting</span>
<span style="color: #95a5a6; font-style: italic;">     annotation. </span><span style="color: #95a5a6;">*)</span>
  | <span style="color: #7f8c8d;">(</span>x1, y1, z1<span style="color: #7f8c8d;">)</span>, <span style="color: #7f8c8d;">(</span>x2, y2, z2<span style="color: #7f8c8d;">)</span> -&gt;
     <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">xdiff</span> = x2 -. x1
     <span style="color: #34495e;">and</span> <span style="color: #9b59b6;">ydiff</span> = y2 -. y1
     <span style="color: #34495e;">and</span> <span style="color: #9b59b6;">zdiff</span> = z2 -. z1 <span style="color: #34495e;">in</span>
     sqrt <span style="color: #7f8c8d;">(</span>square xdiff +. square ydiff +. square zdiff<span style="color: #7f8c8d;">)</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
