intro_ocaml.org
** Grouping information : Records (aka named tuples)

   #+begin_src ocaml
     type point_2d = { x : float; y: float; }  ;;

     (* C-like . notations for field access *)
     let dist p1 p2 =
       let xdiff = p1.x -. p2.x
       and ydiff = p1.y -. p2.y in
       sqrt (xdiff *. xdiff +. ydiff *. ydiff)
     ;;

     (* Using pattern-matching *)
     let dist2 p1 p2 =
       match p1, p2 with
       | { x; y; }, { x = x'; y = y';} ->
          let xdiff = x -. x'
          and ydiff = y -. y' in
          sqrt (xdiff *. xdiff +. ydiff *. ydiff)
     ;;

     (* Record can be built/destructed using a shortcut notation.
        [let create x y = { x; y; }] is a shortcut for
        [let create x y = { x = x; y = y; }].

        Choose your field names wisely and unleash your inner procrastinator !
      *)
     let create x y = { x; y; } ;;

     let of_int myx myy = { x = float myx; y = float myy; } ;;
   #+end_src


   #+begin_quote
   Records are limited to 2^{22} − 1 fields 
   #+end_quote


** ADT & pattern matching

   Exhaustive and fragile pattern matching are reported by default.

   #+begin_src ocaml
     type prop =
       | Cst of bool
       | Var of string
       | Band of prop * prop
       | Bor of prop * prop
       | Bnot of prop
     ;;

     let free_variables =
     (* The pattern matching here is well-typeg but not exhaustive *)
       let rec loop vars =
         | Var s -> if List.mem s vars then vars else s :: vars
         | Band (p1, p2) ->
            let vars' = loop vars p1 in
            loop vars' p2
       in loop []
     ;;

     let free_variables =
       (* Now it is exhaustive, but ... fragile *)
       let rec loop vars =
         | Var s -> if List.mem s vars then vars else s :: vars
         | Band (p1, p2) ->
            let vars' = loop vars p1 in
            loop vars' p2
         | Bor (p1, p2) ->
            let vars' = loop vars p1 in
            loop vars' p2
         | Bnot p -> loop vars p
         | _ -> vars (* fragile pattern-matching if a constructor is added, it is
                        matched here *)
       in loop []
     ;;
#+end_src

   The compact solution for this function includes or-patterns.

   #+begin_src ocaml
     let free_variables =
       let rec loop vars = function
         | Var s -> if List.mem s vars then vars else s :: vars
         | Band (p1, p2)
         | Bor (p1, p2) -> (* 'or' pattern *)
            let vars' = loop vars p1 in
            loop vars' p2
         | Bnot p -> loop vars p
         | Cst _ -> vars (* non-fragile pattern-matching *)
         (* When I later add the [Bxor] constructor, the
          * compiler will show me where pattern-matching is not exhaustive.
          *)
       in loop []
     ;;
   #+end_src


   For (way) more:
   - https://dl.acm.org/doi/10.1145/507669.507641

