intro_ocaml.html

<div id="outline-container-org8791940" class="outline-3">
<h3 id="org8791940"><span class="section-number-3">3.8</span> Grouping information : Records (aka named tuples)</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #9b59b6;">point_2d</span> = <span style="color: #7f8c8d;">{</span> x : float; y: float; <span style="color: #7f8c8d;">}</span>  <span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">C-like . notations for field access </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">dist</span> <span style="color: #9b59b6;">p1</span> <span style="color: #9b59b6;">p2</span> =
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">xdiff</span> = p1.x -. p2.x
  <span style="color: #34495e;">and</span> <span style="color: #9b59b6;">ydiff</span> = p1.y -. p2.y <span style="color: #34495e;">in</span>
  sqrt <span style="color: #7f8c8d;">(</span>xdiff *. xdiff +. ydiff *. ydiff<span style="color: #7f8c8d;">)</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Using pattern-matching </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">dist2</span> <span style="color: #9b59b6;">p1</span> <span style="color: #9b59b6;">p2</span> =
  <span style="color: #2980b9;">match</span> p1, p2 <span style="color: #2980b9;">with</span>
  | <span style="color: #7f8c8d;">{</span> x; y; <span style="color: #7f8c8d;">}</span>, <span style="color: #7f8c8d;">{</span> x = x'; y = y';<span style="color: #7f8c8d;">}</span> -&gt;
     <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">xdiff</span> = x -. x'
     <span style="color: #34495e;">and</span> <span style="color: #9b59b6;">ydiff</span> = y -. y' <span style="color: #34495e;">in</span>
     sqrt <span style="color: #7f8c8d;">(</span>xdiff *. xdiff +. ydiff *. ydiff<span style="color: #7f8c8d;">)</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Record can be built/destructed using a shortcut notation.</span>
<span style="color: #95a5a6; font-style: italic;">   [let create x y = { x; y; }] is a shortcut for</span>
<span style="color: #95a5a6; font-style: italic;">   [let create x y = { x = x; y = y; }].</span>

<span style="color: #95a5a6; font-style: italic;">   Choose your field names wisely and unleash your inner procrastinator !</span>
<span style="color: #95a5a6; font-style: italic;"> </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">create</span> <span style="color: #9b59b6;">x</span> <span style="color: #9b59b6;">y</span> = <span style="color: #7f8c8d;">{</span> x; y; <span style="color: #7f8c8d;">}</span> <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">of_int</span> <span style="color: #9b59b6;">myx</span> <span style="color: #9b59b6;">myy</span> = <span style="color: #7f8c8d;">{</span> x = float myx; y = float myy; <span style="color: #7f8c8d;">}</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>


<blockquote>
<p>
Records are limited to 2<sup>22</sup> − 1 fields 
</p>
</blockquote>
</div>
</div>


<div id="outline-container-orgf73df03" class="outline-3">
<h3 id="orgf73df03"><span class="section-number-3">3.9</span> ADT &amp; pattern matching</h3>
<div class="outline-text-3" id="text-3-9">
<p>
Exhaustive and fragile pattern matching are reported by default.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #9b59b6;">prop</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Cst</span> <span style="color: #2980b9;">of</span> bool
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Var</span> <span style="color: #2980b9;">of</span> string
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Band</span> <span style="color: #2980b9;">of</span> prop * prop
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bor</span> <span style="color: #2980b9;">of</span> prop * prop
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bnot</span> <span style="color: #2980b9;">of</span> prop
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">free_variables</span> =
<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">The pattern matching here is well-typeg but not exhaustive </span><span style="color: #95a5a6;">*)</span>
  <span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">loop</span> <span style="color: #9b59b6;">vars</span> =
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Var</span> s -&gt; <span style="color: #2980b9;">if</span> <span style="color: #2492db; font-weight: bold;">List.</span>mem s vars <span style="color: #2980b9;">then</span> vars <span style="color: #2980b9;">else</span> s <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> vars
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Band</span> <span style="color: #7f8c8d;">(</span>p1, p2<span style="color: #7f8c8d;">)</span> -&gt;
       <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">vars'</span> = loop vars p1 <span style="color: #34495e;">in</span>
       loop vars' p2
  <span style="color: #34495e;">in</span> loop <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">free_variables</span> =
  <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Now it is exhaustive, but ... fragile </span><span style="color: #95a5a6;">*)</span>
  <span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">loop</span> <span style="color: #9b59b6;">vars</span> =
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Var</span> s -&gt; <span style="color: #2980b9;">if</span> <span style="color: #2492db; font-weight: bold;">List.</span>mem s vars <span style="color: #2980b9;">then</span> vars <span style="color: #2980b9;">else</span> s <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> vars
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Band</span> <span style="color: #7f8c8d;">(</span>p1, p2<span style="color: #7f8c8d;">)</span> -&gt;
       <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">vars'</span> = loop vars p1 <span style="color: #34495e;">in</span>
       loop vars' p2
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bor</span> <span style="color: #7f8c8d;">(</span>p1, p2<span style="color: #7f8c8d;">)</span> -&gt;
       <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">vars'</span> = loop vars p1 <span style="color: #34495e;">in</span>
       loop vars' p2
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bnot</span> p -&gt; loop vars p
    | _ -&gt; vars <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">fragile pattern-matching if a constructor is added, it is</span>
<span style="color: #95a5a6; font-style: italic;">                   matched here </span><span style="color: #95a5a6;">*)</span>
  <span style="color: #34495e;">in</span> loop <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
The compact solution for this function includes or-patterns.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #9b59b6;">free_variables</span> =
  <span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">loop</span> <span style="color: #9b59b6;">vars</span> = <span style="color: #2980b9;">function</span>
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Var</span> s -&gt; <span style="color: #2980b9;">if</span> <span style="color: #2492db; font-weight: bold;">List.</span>mem s vars <span style="color: #2980b9;">then</span> vars <span style="color: #2980b9;">else</span> s <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> vars
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Band</span> <span style="color: #7f8c8d;">(</span>p1, p2<span style="color: #7f8c8d;">)</span>
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bor</span> <span style="color: #7f8c8d;">(</span>p1, p2<span style="color: #7f8c8d;">)</span> -&gt; <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">'or' pattern </span><span style="color: #95a5a6;">*)</span>
       <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">vars'</span> = loop vars p1 <span style="color: #34495e;">in</span>
       loop vars' p2
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bnot</span> p -&gt; loop vars p
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Cst</span> _ -&gt; vars <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">non-fragile pattern-matching </span><span style="color: #95a5a6;">*)</span>
    <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">When I later add the [Bxor] constructor, the</span>
<span style="color: #95a5a6; font-style: italic;">     * compiler will show me where pattern-matching is not exhaustive.</span>
<span style="color: #95a5a6; font-style: italic;">     </span><span style="color: #95a5a6;">*)</span>
  <span style="color: #34495e;">in</span> loop <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>


<p>
For (way) more:
</p>
<ul class="org-ul">
<li><a href="https://dl.acm.org/doi/10.1145/507669.507641">https://dl.acm.org/doi/10.1145/507669.507641</a></li>
</ul>
</div>
</div>
