intro_ocaml.org
** Labels (aka named arguments)

   Named arguments are mainly used for 2 reasons:
   - name-based disambiguation of same type parameters

     #+begin_src ocaml
     type interval = { lo : int; hi : int } ;;
     let create ~lo ~hi = { lo; hi; }
     #+end_src

   - homogeneous naming betting on programmers' procrastination

     #+begin_src ocaml
     (* Which version would you rather write? *)

     let lo = 12 and hi = 15 in create ~lo ~hi  ;;

     let lbd = 12 and ubd = 15 in create ~lo:lbd ~hi:ubd ;;
     #+end_src





** Optional arguments

   A special case of named arguments is optional arguments

     #+begin_src ocaml
       type interval = { lo : int; hi : int } ;;

       let create ?(lo=0) hi = { lo; hi; } ;;

       create 2;;


       let create ?(lo=0) ~hi () = { lo; hi; } ;;

       let ival = create ~hi:2 ();;


       (* The use of partial arguments complicate a little bit closure computations.*)
       let pp_ival ?(pre="(") ?(post=")") ?(sep=",")ppf { lo; hi; } =
         Format.fprintf ppf "@[<h>%s%d%s%d%s@]" pre lo sep hi post
       ;;

       (* The following does not type *)
       Format.printf "%a@." pp_ival ival ;;

       (* You need to create another function *)
       Format.printf "%a@." (fun ppf ival -> pp_ival ppf ival) ival ;;

       (* The following does work though *)
       let pp_ival2 ppf = pp_ival ppf ;;
       Format.printf "%a@." pp_ival2 ival ;;
     #+end_src


** Optional arguments *are* option types

   #+begin_src ocaml
     type ('a, 'b) return = {
         value : 'a;
         explanation : 'b option;
       }
     ;;

     (* Optional arguments of a type ['a] are really ['a option] types and ce be
      ,* used that way in the body of the function *)
     let create_return_value ?explanation value =
       { value; explanation; }
     ;;

     (* Now if you have a default value [v], [Some v] needs to be used. *)
     let create_defaulted_return_value ?(explanation="message") value =
       { value; explanation = Some explanation; }
     ;;

     (* The construction below does not type. *)
     let create_defaulted_return_value ?(explanation="message") value =
       { value; explanation; }
     ;;
   #+end_src

** Using named arguments in practice

    A commonly used recipe to construct functions with named arguments is:
    1. Put your optional arguments
    2. Put your named arguments
    3. Put the rest of your arguments

** Nice to have: type-directed record disambiguation

   #+begin_src ocaml
     type t = { x : float; y : int; } ;;

     (* Shadowing x and y *)
     type t' = { x : int; y : float; } ;;


     let addall (v1:t) v2 =
       let xsum = truncate v1.x + v2.x in
       let ysum = v1.y + truncate v2.y in
       xsum + ysum
     ;;
   #+end_src

   Check out:
   1. http://gallium.inria.fr/~scherer/gagallium/resolving-field-names/
   2. http://gallium.inria.fr/~scherer/gagallium/resolving-field-names-2/



* Imperative programming

** It's ok to be impure

   A bunch of OCaml primitive constructs are imperative.

   - ref
   - mutable field in records
   - arrays
   - hashtables
   - bytes (aka strings before 4.02)
   - stacks, queues, ....

   No need to read Okasaki's book to understand their implementation ;-)


