intro_ocaml.html

<div id="outline-container-org99f1ef2" class="outline-3">
<h3 id="org99f1ef2"><span class="section-number-3">3.10</span> Labels (aka named arguments)</h3>
<div class="outline-text-3" id="text-3-10">
<p>
Named arguments are mainly used for 2 reasons:
</p>
<ul class="org-ul">
<li><p>
name-based disambiguation of same type parameters
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #9b59b6;">interval</span> = <span style="color: #7f8c8d;">{</span> lo : int; hi : int <span style="color: #7f8c8d;">}</span> <span style="color: #ff4500;">;;</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">create</span> ~<span style="color: #9b59b6;">lo</span> ~<span style="color: #9b59b6;">hi</span> = <span style="color: #7f8c8d;">{</span> lo; hi; <span style="color: #7f8c8d;">}</span>
</pre>
</div></li>

<li><p>
homogeneous naming betting on programmers' procrastination
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Which version would you rather write? </span><span style="color: #95a5a6;">*)</span>

<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">lo</span> = 12 <span style="color: #34495e;">and</span> <span style="color: #9b59b6;">hi</span> = 15 <span style="color: #34495e;">in</span> create ~lo ~hi  <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">lbd</span> = 12 <span style="color: #34495e;">and</span> <span style="color: #9b59b6;">ubd</span> = 15 <span style="color: #34495e;">in</span> create <span style="color: #0a74b9;">~lo</span>:lbd <span style="color: #0a74b9;">~hi</span>:ubd <span style="color: #ff4500;">;;</span>
</pre>
</div></li>
</ul>
</div>
</div>





<div id="outline-container-orga99a2b1" class="outline-3">
<h3 id="orga99a2b1"><span class="section-number-3">3.11</span> Optional arguments</h3>
<div class="outline-text-3" id="text-3-11">
<p>
A special case of named arguments is optional arguments
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #9b59b6;">interval</span> = <span style="color: #7f8c8d;">{</span> lo : int; hi : int <span style="color: #7f8c8d;">}</span> <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">create</span> ?<span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">lo</span>=0<span style="color: #7f8c8d;">)</span> <span style="color: #9b59b6;">hi</span> = <span style="color: #7f8c8d;">{</span> lo; hi; <span style="color: #7f8c8d;">}</span> <span style="color: #ff4500;">;;</span>

create 2<span style="color: #ff4500;">;;</span>


<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">create</span> ?<span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">lo</span>=0<span style="color: #7f8c8d;">)</span> ~<span style="color: #9b59b6;">hi</span> <span style="color: #7f8c8d;">()</span> = <span style="color: #7f8c8d;">{</span> lo; hi; <span style="color: #7f8c8d;">}</span> <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">ival</span> = create <span style="color: #0a74b9;">~hi</span>:2 <span style="color: #7f8c8d;">()</span><span style="color: #ff4500;">;;</span>


<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">The use of partial arguments complicate a little bit closure computations.</span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">pp_ival</span> ?<span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">pre</span>=<span style="color: #27ae60;">"("</span><span style="color: #7f8c8d;">)</span> ?<span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">post</span>=<span style="color: #27ae60;">")"</span><span style="color: #7f8c8d;">)</span> ?<span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">sep</span>=<span style="color: #27ae60;">","</span><span style="color: #7f8c8d;">)</span><span style="color: #9b59b6;">ppf</span> <span style="color: #7f8c8d;">{</span> <span style="color: #9b59b6;">lo</span>; <span style="color: #9b59b6;">hi</span>; <span style="color: #7f8c8d;">}</span> =
  <span style="color: #2492db; font-weight: bold;">Format.</span>fprintf ppf <span style="color: #27ae60;">"@[&lt;h&gt;%s%d%s%d%s@]"</span> pre lo sep hi post
<span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">The following does not type </span><span style="color: #95a5a6;">*)</span>
<span style="color: #2492db; font-weight: bold;">Format.</span>printf <span style="color: #27ae60;">"%a@."</span> pp_ival ival <span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">You need to create another function </span><span style="color: #95a5a6;">*)</span>
<span style="color: #2492db; font-weight: bold;">Format.</span>printf <span style="color: #27ae60;">"%a@."</span> <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">ppf</span> <span style="color: #9b59b6;">ival</span> -&gt; pp_ival ppf ival<span style="color: #7f8c8d;">)</span> ival <span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">The following does work though </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">pp_ival2</span> <span style="color: #9b59b6;">ppf</span> = pp_ival ppf <span style="color: #ff4500;">;;</span>
<span style="color: #2492db; font-weight: bold;">Format.</span>printf <span style="color: #27ae60;">"%a@."</span> pp_ival2 ival <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org5377c4d" class="outline-3">
<h3 id="org5377c4d"><span class="section-number-3">3.12</span> Optional arguments <b>are</b> option types</h3>
<div class="outline-text-3" id="text-3-12">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">'a, 'b</span><span style="color: #7f8c8d;">)</span><span style="color: #9b59b6;"> return</span> = <span style="color: #7f8c8d;">{</span>
    value : 'a;
    explanation : 'b option;
  <span style="color: #7f8c8d;">}</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Optional arguments of a type ['a] are really ['a option] types and ce be</span>
<span style="color: #95a5a6; font-style: italic;"> * used that way in the body of the function </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">create_return_value</span> ?<span style="color: #9b59b6;">explanation</span> <span style="color: #9b59b6;">value</span> =
  <span style="color: #7f8c8d;">{</span> value; explanation; <span style="color: #7f8c8d;">}</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Now if you have a default value [v], [Some v] needs to be used. </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">create_defaulted_return_value</span> ?<span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">explanation</span>=<span style="color: #27ae60;">"message"</span><span style="color: #7f8c8d;">)</span> <span style="color: #9b59b6;">value</span> =
  <span style="color: #7f8c8d;">{</span> value; explanation = <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Some</span> explanation; <span style="color: #7f8c8d;">}</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">The construction below does not type. </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">create_defaulted_return_value</span> ?<span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">explanation</span>=<span style="color: #27ae60;">"message"</span><span style="color: #7f8c8d;">)</span> <span style="color: #9b59b6;">value</span> =
  <span style="color: #7f8c8d;">{</span> value; explanation; <span style="color: #7f8c8d;">}</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcee7adf" class="outline-3">
<h3 id="orgcee7adf"><span class="section-number-3">3.13</span> Using named arguments in practice</h3>
<div class="outline-text-3" id="text-3-13">
<p>
A commonly used recipe to construct functions with named arguments is:
</p>
<ol class="org-ol">
<li>Put your optional arguments</li>
<li>Put your named arguments</li>
<li>Put the rest of your arguments</li>
</ol>
</div>
</div>

<div id="outline-container-org54d3953" class="outline-3">
<h3 id="org54d3953"><span class="section-number-3">3.14</span> Nice to have: type-directed record disambiguation</h3>
<div class="outline-text-3" id="text-3-14">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> = <span style="color: #7f8c8d;">{</span> x : float; y : int; <span style="color: #7f8c8d;">}</span> <span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Shadowing x and y </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t'</span> = <span style="color: #7f8c8d;">{</span> x : int; y : float; <span style="color: #7f8c8d;">}</span> <span style="color: #ff4500;">;;</span>


<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">addall</span> <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">v1</span>:<span style="color: #9b59b6;">t</span><span style="color: #7f8c8d;">)</span> <span style="color: #9b59b6;">v2</span> =
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">xsum</span> = truncate v1.x + v2.x <span style="color: #34495e;">in</span>
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">ysum</span> = v1.y + truncate v2.y <span style="color: #34495e;">in</span>
  xsum + ysum
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
Check out:
</p>
<ol class="org-ol">
<li><a href="http://gallium.inria.fr/~scherer/gagallium/resolving-field-names/">http://gallium.inria.fr/~scherer/gagallium/resolving-field-names/</a></li>
<li><a href="http://gallium.inria.fr/~scherer/gagallium/resolving-field-names-2/">http://gallium.inria.fr/~scherer/gagallium/resolving-field-names-2/</a></li>
</ol>
</div>
</div>
</div>



<div id="outline-container-orgfb4a9fc" class="outline-2">
<h2 id="orgfb4a9fc"><span class="section-number-2">4</span> Imperative programming</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc008e66" class="outline-3">
<h3 id="orgc008e66"><span class="section-number-3">4.1</span> It's ok to be impure</h3>
<div class="outline-text-3" id="text-4-1">
<p>
A bunch of OCaml primitive constructs are imperative.
</p>

<ul class="org-ul">
<li>ref</li>
<li>mutable field in records</li>
<li>arrays</li>
<li>hashtables</li>
<li>bytes (aka strings before 4.02)</li>
<li>stacks, queues, &#x2026;.</li>
</ul>

<p>
No need to read Okasaki's book to understand their implementation ;-)
</p>
</div>
</div>
