intro_ocaml.org
** The unit type

   The type of sequence elements (think 'statement') is ~unit~, which is
   inhabited by a single value ~()~.

   #+begin_src ocaml
     let fact n =
       let res = ref 1 in
       for j = 2 to n do
         res := !res * j; (* this assignment has type unit *)
       done;
       !res
     ;;
   #+end_src

** Trivia :: What's in a reference?

   #+begin_src ocaml
     let x = ref 1 ;;

     let y = { contents = 12 } ;;

     type 'a ref = { mutable contents : 'a };;
   #+end_src

** Typical OCaml code

   Typical code mixes and matches functional and imperative features, usually
   for efficiency reasons. You will not be castigated for doing so.

  #+BEGIN_SRC ocaml
    (* Assuming I use a list-based representation for sets, it is very idiomatic
     ,* way to write the code below *)
    let cardinal l =
      let h = Hashtbl.create 7 in
      let rec loop = function
        | x :: xs ->
           Hashtbl.add h x (); (* Hashtbl.replace may be better here *)
           loop xs
        | [] ->
           Hashtbl.length h
      in loop l
    ;;
#+END_SRC

#+BEGIN_SRC ocaml
    (* Concatenating the elements of a string list *)
    let concat =
      (* An OCaml [Buffer.t] is similar to a Java [StringBuffer].
       ,* It is a self-growing array bytes.
       ,*)
      let b = Buffer.create 1024 in
      fun ~sep l ->
      Buffer.reset b;    (* cleanup any previously written contents *)
      List.iter
      (fun s -> Buffer.add_string b s;
                Buffer.add_string b sep;)
      l;
      Buffer.contents b
    ;;
  #+END_SRC


** Trivia :: Hashtables

   Hashtables have an interesting property : ~add~ does not remove old values!

   #+begin_src ocaml
     let h = Hashtbl.create 7 ;;
     Hashtbl.add h 1 2 ;;
     Hashtbl.add h 1 3 ;;
     Hashtbl.iter (fun k v -> Format.printf "%d -> %d@." k v) h ;;
   #+end_src

** Pitfall(s)

  The use of ~;~ leads to some pitfalls for the beginner (and the guru not
  paying enough attention).

  #+begin_src ocaml
    (* This is syntactilly incorrect *)
    let test_and_print =
      let count_success = ref 0 in
      fun secret ->
      if secret = "you will never guess that" then
        incr count_success;
        Format.printf "Success"
      else Format.printf "Failure"
    ;;

    (* This is *)
    let test_and_print =
      let count_success = ref 0 in
      fun secret ->
      if secret = "you will never guess that" then begin
          incr count_success;
          Format.printf "Success"
        end
      else Format.printf "Failure"
    ;;
  #+end_src

** Exceptions

   Exceptions are open algebraic data types with a dedicated construct ~exception~

   #+begin_src ocaml
     exception Empty_list ;;

     let nth i l =
       assert (i >= 0);
       let rec aux j = function
         | [] ->
            raise Empty_list
         | x :: xs ->
            if j = 0 then x
            else aux (j - 1) xs
       in aux i l
     ;;
   #+end_src



