intro_ocaml.html


<div id="outline-container-orgd92931e" class="outline-3">
<h3 id="orgd92931e"><span class="section-number-3">4.2</span> The unit type</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The type of sequence elements (think 'statement') is <code>unit</code>, which is
inhabited by a single value <code>()</code>.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">fact</span> <span style="color: #9b59b6;">n</span> =
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">res</span> = <span style="color: #34495e;">ref</span> 1 <span style="color: #34495e;">in</span>
  <span style="color: #2980b9;">for</span> j = 2 <span style="color: #2980b9;">to</span> n <span style="color: #2980b9;">do</span>
    res := <span style="color: #c0392b;">!</span>res * j; <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">this assignment has type unit </span><span style="color: #95a5a6;">*)</span>
  <span style="color: #2980b9;">done</span>;
  <span style="color: #c0392b;">!</span>res
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org18f8421" class="outline-3">
<h3 id="org18f8421"><span class="section-number-3">4.3</span> Trivia :: What's in a reference?</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #9b59b6;">x</span> = <span style="color: #34495e;">ref</span> 1 <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">y</span> = <span style="color: #7f8c8d;">{</span> contents = 12 <span style="color: #7f8c8d;">}</span> <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">type</span> <span style="color: #9b59b6;">'a ref</span> = <span style="color: #7f8c8d;">{</span> <span style="color: #2980b9;">mutable</span> contents : 'a <span style="color: #7f8c8d;">}</span><span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org826d880" class="outline-3">
<h3 id="org826d880"><span class="section-number-3">4.4</span> Typical OCaml code</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Typical code mixes and matches functional and imperative features, usually
for efficiency reasons. You will not be castigated for doing so.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Assuming I use a list-based representation for sets, it is very idiomatic</span>
<span style="color: #95a5a6; font-style: italic;"> * way to write the code below </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">cardinal</span> <span style="color: #9b59b6;">l</span> =
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">h</span> = <span style="color: #2492db; font-weight: bold;">Hashtbl.</span>create 7 <span style="color: #34495e;">in</span>
  <span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">loop</span> = <span style="color: #2980b9;">function</span>
    | x <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> xs -&gt;
       <span style="color: #2492db; font-weight: bold;">Hashtbl.</span>add h x <span style="color: #7f8c8d;">()</span>; <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Hashtbl.replace may be better here </span><span style="color: #95a5a6;">*)</span>
       loop xs
    | <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span> -&gt;
       <span style="color: #2492db; font-weight: bold;">Hashtbl.</span>length h
  <span style="color: #34495e;">in</span> loop l
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Concatenating the elements of a string list </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">concat</span> =
  <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">An OCaml [Buffer.t] is similar to a Java [StringBuffer].</span>
<span style="color: #95a5a6; font-style: italic;">   * It is a self-growing array bytes.</span>
<span style="color: #95a5a6; font-style: italic;">   </span><span style="color: #95a5a6;">*)</span>
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">b</span> = <span style="color: #2492db; font-weight: bold;">Buffer.</span>create 1024 <span style="color: #34495e;">in</span>
  <span style="color: #2980b9;">fun</span> ~<span style="color: #9b59b6;">sep</span> <span style="color: #9b59b6;">l</span> -&gt;
  <span style="color: #2492db; font-weight: bold;">Buffer.</span>reset b;    <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">cleanup any previously written contents </span><span style="color: #95a5a6;">*)</span>
  <span style="color: #2492db; font-weight: bold;">List.</span>iter
  <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">s</span> -&gt; <span style="color: #2492db; font-weight: bold;">Buffer.</span>add_string b s;
            <span style="color: #2492db; font-weight: bold;">Buffer.</span>add_string b sep;<span style="color: #7f8c8d;">)</span>
  l;
  <span style="color: #2492db; font-weight: bold;">Buffer.</span>contents b
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org713f781" class="outline-3">
<h3 id="org713f781"><span class="section-number-3">4.5</span> Trivia :: Hashtables</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Hashtables have an interesting property : <code>add</code> does not remove old values!
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #9b59b6;">h</span> = <span style="color: #2492db; font-weight: bold;">Hashtbl.</span>create 7 <span style="color: #ff4500;">;;</span>
<span style="color: #2492db; font-weight: bold;">Hashtbl.</span>add h 1 2 <span style="color: #ff4500;">;;</span>
<span style="color: #2492db; font-weight: bold;">Hashtbl.</span>add h 1 3 <span style="color: #ff4500;">;;</span>
<span style="color: #2492db; font-weight: bold;">Hashtbl.</span>iter <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">k</span> <span style="color: #9b59b6;">v</span> -&gt; <span style="color: #2492db; font-weight: bold;">Format.</span>printf <span style="color: #27ae60;">"%d -&gt; %d@."</span> k v<span style="color: #7f8c8d;">)</span> h <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c347aa" class="outline-3">
<h3 id="org6c347aa"><span class="section-number-3">4.6</span> Pitfall(s)</h3>
<div class="outline-text-3" id="text-4-6">
<p>
The use of <code>;</code> leads to some pitfalls for the beginner (and the guru not
paying enough attention).
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">This is syntactilly incorrect </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">test_and_print</span> =
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">count_success</span> = <span style="color: #34495e;">ref</span> 0 <span style="color: #34495e;">in</span>
  <span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">secret</span> -&gt;
  <span style="color: #2980b9;">if</span> secret = <span style="color: #27ae60;">"you will never guess that"</span> <span style="color: #2980b9;">then</span>
    incr count_success;
    <span style="color: #2492db; font-weight: bold;">Format.</span>printf <span style="color: #27ae60;">"Success"</span>
  <span style="color: #2980b9;">else</span> <span style="color: #2492db; font-weight: bold;">Format.</span>printf <span style="color: #27ae60;">"Failure"</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">This is </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">test_and_print</span> =
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">count_success</span> = <span style="color: #34495e;">ref</span> 0 <span style="color: #34495e;">in</span>
  <span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">secret</span> -&gt;
  <span style="color: #2980b9;">if</span> secret = <span style="color: #27ae60;">"you will never guess that"</span> <span style="color: #2980b9;">then</span> <span style="color: #34495e;">begin</span>
      incr count_success;
      <span style="color: #2492db; font-weight: bold;">Format.</span>printf <span style="color: #27ae60;">"Success"</span>
    <span style="color: #34495e;">end</span>
  <span style="color: #2980b9;">else</span> <span style="color: #2492db; font-weight: bold;">Format.</span>printf <span style="color: #27ae60;">"Failure"</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c22793" class="outline-3">
<h3 id="org9c22793"><span class="section-number-3">4.7</span> Exceptions</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Exceptions are open algebraic data types with a dedicated construct <code>exception</code>
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #2980b9;">exception</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Empty_list</span> <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">nth</span> <span style="color: #9b59b6;">i</span> <span style="color: #9b59b6;">l</span> =
  <span style="color: #2980b9;">assert</span> <span style="color: #7f8c8d;">(</span>i &gt;= 0<span style="color: #7f8c8d;">)</span>;
  <span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">aux</span> <span style="color: #9b59b6;">j</span> = <span style="color: #2980b9;">function</span>
    | <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span> -&gt;
       <span style="color: #34495e;">raise</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Empty_list</span>
    | x <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> xs -&gt;
       <span style="color: #2980b9;">if</span> j = 0 <span style="color: #2980b9;">then</span> x
       <span style="color: #2980b9;">else</span> aux <span style="color: #7f8c8d;">(</span>j - 1<span style="color: #7f8c8d;">)</span> xs
  <span style="color: #34495e;">in</span> aux i l
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
