intro_ocaml.org
** Local exceptions & pattern-matching mixed exceptions/values

   #+begin_src ocaml
     let find (type a) (p:a -> bool) (arr:a array) =
       let exception Found of a in
       match Array.iter (fun e -> if p e then raise (Found e)) arr with
       | () -> None
       | exception (Found elt) -> Some elt
     ;;
   #+end_src


* More advanced topics

** What's a module?

   The moment you have 2 files, you will be manipulating *modules*.

   A module is an abstraction barrier to used to bundle together related
   definitions and functionalities. In particular, it defines a namespace.

   A file defines a module: Both files ~File~ and ~file~ define module ~File~
   (thank you case-insensitive world).

   Inside a module, one can define other modules.

   Modules can be recursive.

** Interface & implementation :: ~mli~ & ~ml~

   ~OCaml~ programmers are encouraged to detach API interface (documentation,
   typing, ...) from their implementation.

   The usage is to *not* type every and all functions coded, only the ones that
   are exported and those whose type cannot be correctly inferred.

   So for a given file-based module
   - ~mli~ files contain interfaces (aka type signatures)
   - ~ml~  files contain implementations

     For "programmatic" modules, you will use ~module type~ to abstract
     functionalities/traits and ~module~ for implementing said modules.


** Levels of type abstraction

   Modules help to delimit abstraction barriers and one can choose the desired
   level of abstraction.

*** Open

    Open types can be directly constructed & destructed

                 #+begin_src ocaml
                   module Interval = struct
                     type t =
                     | Ival of { lo : int; hi : int; }
                     | Top
                     ;;

                     let top = Top ;;

                     let ival ~lo ~hi =
                       assert (lo <= hi);
                       if lo = min_int && hi = max_int then top
                       else Ival {lo; hi;}
                     ;;

                   end
                   ;;

                   open Interval

                   (* Pattern-matching is ok *)
                   let size = function
                     | Ival {lo; hi; } -> float @@ hi - lo + 1
                     | Top -> infinity
                   ;;

                   (* This is authorized. *)
                   let interval = Top ;;

                   (* This is for the [top] function is part of the module signatures. *)
                   let top2 = top ;;
                 #+end_src


