intro_ocaml.html



<div id="outline-container-org17a937f" class="outline-3">
<h3 id="org17a937f"><span class="section-number-3">4.8</span> Local exceptions &amp; pattern-matching mixed exceptions/values</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">find</span> <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">type</span> <span style="color: #9b59b6;">a</span><span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">p</span>:<span style="color: #9b59b6;">a -&gt; bool</span><span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">arr</span>:<span style="color: #9b59b6;">a array</span><span style="color: #7f8c8d;">)</span> =
  <span style="color: #34495e;">let exception</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Found</span> <span style="color: #2980b9;">of</span> a <span style="color: #34495e;">in</span>
  <span style="color: #2980b9;">match</span> <span style="color: #2492db; font-weight: bold;">Array.</span>iter <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">e</span> -&gt; <span style="color: #2980b9;">if</span> p e <span style="color: #2980b9;">then</span> <span style="color: #34495e;">raise</span> <span style="color: #2c3e50;">(</span><span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Found</span> e<span style="color: #2c3e50;">)</span><span style="color: #7f8c8d;">)</span> arr <span style="color: #2980b9;">with</span>
  | <span style="color: #7f8c8d;">()</span> -&gt; <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">None</span>
  | <span style="color: #2980b9;">exception</span> <span style="color: #7f8c8d;">(</span><span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Found</span> elt<span style="color: #7f8c8d;">)</span> -&gt; <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Some</span> elt
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgc93a7a1" class="outline-2">
<h2 id="orgc93a7a1"><span class="section-number-2">5</span> More advanced topics</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org9d06255" class="outline-3">
<h3 id="org9d06255"><span class="section-number-3">5.1</span> What's a module?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
The moment you have 2 files, you will be manipulating <b>modules</b>.
</p>

<p>
A module is an abstraction barrier to used to bundle together related
definitions and functionalities. In particular, it defines a namespace.
</p>

<p>
A file defines a module: Both files <code>File</code> and <code>file</code> define module <code>File</code>
(thank you case-insensitive world).
</p>

<p>
Inside a module, one can define other modules.
</p>

<p>
Modules can be recursive.
</p>
</div>
</div>

<div id="outline-container-org20fbbee" class="outline-3">
<h3 id="org20fbbee"><span class="section-number-3">5.2</span> Interface &amp; implementation :: <code>mli</code> &amp; <code>ml</code></h3>
<div class="outline-text-3" id="text-5-2">
<p>
<code>OCaml</code> programmers are encouraged to detach API interface (documentation,
typing, &#x2026;) from their implementation.
</p>

<p>
The usage is to <b>not</b> type every and all functions coded, only the ones that
are exported and those whose type cannot be correctly inferred.
</p>

<p>
So for a given file-based module
</p>
<ul class="org-ul">
<li><code>mli</code> files contain interfaces (aka type signatures)</li>
<li><p>
<code>ml</code>  files contain implementations
</p>

<p>
For "programmatic" modules, you will use <code>module type</code> to abstract
functionalities/traits and <code>module</code> for implementing said modules.
</p></li>
</ul>
</div>
</div>


<div id="outline-container-org2fa5789" class="outline-3">
<h3 id="org2fa5789"><span class="section-number-3">5.3</span> Levels of type abstraction</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Modules help to delimit abstraction barriers and one can choose the desired
level of abstraction.
</p>
</div>

<div id="outline-container-org0484cee" class="outline-4">
<h4 id="org0484cee"><span class="section-number-4">5.3.1</span> Open</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Open types can be directly constructed &amp; destructed
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">module</span> <span style="color: #2492db; font-weight: bold;">Interval</span> = <span style="color: #34495e;">struct</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ival</span> <span style="color: #2980b9;">of</span> <span style="color: #7f8c8d;">{</span> lo : int; hi : int; <span style="color: #7f8c8d;">}</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span>
  <span style="color: #ff4500;">;;</span>

  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">top</span> = <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span> <span style="color: #ff4500;">;;</span>

  <span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">ival</span> ~<span style="color: #9b59b6;">lo</span> ~<span style="color: #9b59b6;">hi</span> =
    <span style="color: #2980b9;">assert</span> <span style="color: #7f8c8d;">(</span>lo &lt;= hi<span style="color: #7f8c8d;">)</span>;
    <span style="color: #2980b9;">if</span> lo = min_int <span style="color: #c0392b;">&amp;&amp;</span> hi = max_int <span style="color: #2980b9;">then</span> top
    <span style="color: #2980b9;">else</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ival</span> <span style="color: #7f8c8d;">{</span>lo; hi;<span style="color: #7f8c8d;">}</span>
  <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">end</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">open </span><span style="color: #2492db; font-weight: bold;">Interval</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Pattern-matching is ok </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">size</span> = <span style="color: #2980b9;">function</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ival</span> <span style="color: #7f8c8d;">{</span>lo; hi; <span style="color: #7f8c8d;">}</span> -&gt; float <span style="color: #c0392b;">@@</span> hi - lo + 1
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span> -&gt; infinity
<span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">This is authorized. </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">interval</span> = <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span> <span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">This is for the [top] function is part of the module signatures. </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">top2</span> = top <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
