intro_ocaml.org
*** private

    Private types can be constructed only by predefined functions, destructed by
    usual pattern matching.

                 #+begin_src ocaml
                   module Interval : sig
                     type t = private
                       | Ival of { lo : int; hi: int;}
                       | Top
                     ;;

                     val ival : lo:int -> hi:int -> t ;;
                     val top : t
                   end = struct
                     type t =
                     | Ival of { lo : int; hi : int; }
                     | Top
                     ;;

                     let top = Top ;;

                     let ival ~lo ~hi =
                       assert (lo <= hi);
                       if lo = min_int && hi = max_int then top
                       else Ival {lo; hi;}
                     ;;

                   end
                   ;;

                   open Interval

                   (* Pattern-matching is ok on private type *)
                   let size = function
                     | Ival {lo; hi; } -> float @@ hi - lo + 1
                     | Top -> infinity
                   ;;

                   (* This is not authorized. *)
                   let interval = Top ;;

                   (* This is for the [top] function is part of the module signatures. *)
                   let top2 = top ;;
                 #+end_src


***  abstract

    Abstract types can be constructed & destructed only be predefined functions

                 #+begin_src ocaml
                   module Interval : sig
                     type t (* opaque to the outside world *)
                     val ival : lo:int -> hi:int -> t ;;
                     val top : t

                     val is_top : t -> bool
                     val lo : t -> int (* raises an exception *)
                     val hi : t -> int
                   end = struct
                     type t =
                     | Ival of { lo : int; hi : int; }
                     | Top
                     ;;

                     let top = Top ;;

                     let ival ~lo ~hi =
                       assert (lo <= hi);
                       if lo = min_int && hi = max_int then top
                       else Ival {lo; hi;}
                     ;;

                   end
                   ;;

                   open Interval

                   (* Pattern-matching does not work anymore *)
                   let size ival =
                     if is_top ival then infinity
                     else  hi ival - lo ival + 1
                   ;;

                   (* This is still not authorized. *)
                   let interval = Top ;;

                   (* This is for the [top] function is part of the module signatures. *)
                   let top2 = top ;;
                 #+end_src


** Genericity

*** Ad-hoc polymorphism

    #+begin_src ocaml
      let rec length match l with
        | [] -> 0
        | _ :: l' -> 1 + length l'
      ;;
    #+end_src

