intro_ocaml.html


<div id="outline-container-orga57eb7c" class="outline-4">
<h4 id="orga57eb7c"><span class="section-number-4">5.3.2</span> private</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
Private types can be constructed only by predefined functions, destructed by
usual pattern matching.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">module</span> <span style="color: #2492db; font-weight: bold;">Interval</span> : <span style="color: #34495e;">sig</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> = <span style="color: #2980b9;">private</span>
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ival</span> <span style="color: #2980b9;">of</span> <span style="color: #7f8c8d;">{</span> lo : int; hi: int;<span style="color: #7f8c8d;">}</span>
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span>
  <span style="color: #ff4500;">;;</span>

  <span style="color: #34495e;">val</span> <span style="color: #8e44ad; font-weight: bold;">ival</span> : <span style="color: #0a74b9;">lo</span>:int -&gt; <span style="color: #0a74b9;">hi</span>:int -&gt; t <span style="color: #ff4500;">;;</span>
  <span style="color: #34495e;">val</span> <span style="color: #8e44ad; font-weight: bold;">top</span> : t
<span style="color: #34495e;">end</span> = <span style="color: #34495e;">struct</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ival</span> <span style="color: #2980b9;">of</span> <span style="color: #7f8c8d;">{</span> lo : int; hi : int; <span style="color: #7f8c8d;">}</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span>
  <span style="color: #ff4500;">;;</span>

  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">top</span> = <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span> <span style="color: #ff4500;">;;</span>

  <span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">ival</span> ~<span style="color: #9b59b6;">lo</span> ~<span style="color: #9b59b6;">hi</span> =
    <span style="color: #2980b9;">assert</span> <span style="color: #7f8c8d;">(</span>lo &lt;= hi<span style="color: #7f8c8d;">)</span>;
    <span style="color: #2980b9;">if</span> lo = min_int <span style="color: #c0392b;">&amp;&amp;</span> hi = max_int <span style="color: #2980b9;">then</span> top
    <span style="color: #2980b9;">else</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ival</span> <span style="color: #7f8c8d;">{</span>lo; hi;<span style="color: #7f8c8d;">}</span>
  <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">end</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">open </span><span style="color: #2492db; font-weight: bold;">Interval</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Pattern-matching is ok on private type </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">size</span> = <span style="color: #2980b9;">function</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ival</span> <span style="color: #7f8c8d;">{</span>lo; hi; <span style="color: #7f8c8d;">}</span> -&gt; float <span style="color: #c0392b;">@@</span> hi - lo + 1
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span> -&gt; infinity
<span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">This is not authorized. </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">interval</span> = <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span> <span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">This is for the [top] function is part of the module signatures. </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">top2</span> = top <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orga570af2" class="outline-4">
<h4 id="orga570af2"><span class="section-number-4">5.3.3</span> abstract</h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
Abstract types can be constructed &amp; destructed only be predefined functions
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">module</span> <span style="color: #2492db; font-weight: bold;">Interval</span> : <span style="color: #34495e;">sig</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">opaque to the outside world </span><span style="color: #95a5a6;">*)</span>
  <span style="color: #34495e;">val</span> <span style="color: #8e44ad; font-weight: bold;">ival</span> : <span style="color: #0a74b9;">lo</span>:int -&gt; <span style="color: #0a74b9;">hi</span>:int -&gt; t <span style="color: #ff4500;">;;</span>
  <span style="color: #34495e;">val</span> <span style="color: #8e44ad; font-weight: bold;">top</span> : t

  <span style="color: #34495e;">val</span> <span style="color: #8e44ad; font-weight: bold;">is_top</span> : t -&gt; bool
  <span style="color: #34495e;">val</span> <span style="color: #8e44ad; font-weight: bold;">lo</span> : t -&gt; int <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">raises an exception </span><span style="color: #95a5a6;">*)</span>
  <span style="color: #34495e;">val</span> <span style="color: #8e44ad; font-weight: bold;">hi</span> : t -&gt; int
<span style="color: #34495e;">end</span> = <span style="color: #34495e;">struct</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ival</span> <span style="color: #2980b9;">of</span> <span style="color: #7f8c8d;">{</span> lo : int; hi : int; <span style="color: #7f8c8d;">}</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span>
  <span style="color: #ff4500;">;;</span>

  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">top</span> = <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span> <span style="color: #ff4500;">;;</span>

  <span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">ival</span> ~<span style="color: #9b59b6;">lo</span> ~<span style="color: #9b59b6;">hi</span> =
    <span style="color: #2980b9;">assert</span> <span style="color: #7f8c8d;">(</span>lo &lt;= hi<span style="color: #7f8c8d;">)</span>;
    <span style="color: #2980b9;">if</span> lo = min_int <span style="color: #c0392b;">&amp;&amp;</span> hi = max_int <span style="color: #2980b9;">then</span> top
    <span style="color: #2980b9;">else</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ival</span> <span style="color: #7f8c8d;">{</span>lo; hi;<span style="color: #7f8c8d;">}</span>
  <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">end</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">open </span><span style="color: #2492db; font-weight: bold;">Interval</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Pattern-matching does not work anymore </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">size</span> <span style="color: #9b59b6;">ival</span> =
  <span style="color: #2980b9;">if</span> is_top ival <span style="color: #2980b9;">then</span> infinity
  <span style="color: #2980b9;">else</span>  hi ival - lo ival + 1
<span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">This is still not authorized. </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">interval</span> = <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Top</span> <span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">This is for the [top] function is part of the module signatures. </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">top2</span> = top <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org1e91653" class="outline-3">
<h3 id="org1e91653"><span class="section-number-3">5.4</span> Genericity</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org05ecbe4" class="outline-4">
<h4 id="org05ecbe4"><span class="section-number-4">5.4.1</span> Ad-hoc polymorphism</h4>
<div class="outline-text-4" id="text-5-4-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">length</span> <span style="color: #2980b9;">match</span> <span style="color: #9b59b6;">l</span> <span style="color: #2980b9;">with</span>
  | <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span> -&gt; 0
  | <span style="color: #9b59b6;">_</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> l' -&gt; 1 + length l'
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
