intro_ocaml.org
*** Functors (module generator)

    The standard library has functors for sets, maps (tree-based persistent
    dictionaries) and hashtables.

    #+begin_src ocaml
      module type PRINTABLE = sig
        type t
        val pp: Format.formatter -> t -> unit
      end


      module List_printer(X:PRINTABLE) = struct
        type printer_func = Format.formatter -> unit -> unit

        let pp_list
              ?(pre=(fun ppf () -> Format.pp_print_string ppf "["))
              ?(post=(fun ppf () -> Format.pp_print_string ppf "]"))
              ?(sep=(fun ppf () -> Format.fprintf ppf ";@ "))
              ppf l =
          let open Format in
          let rec loop = function
            | [] -> post ppf ()
            | e :: es ->
               begin
                 X.pp ppf e;
                 sep ppf ();
                 loop es
               end
          in pre ppf (); loop l
        ;;
      end

      module Int_list_pp =
        List_printer(struct type t = int let pp = Format.pp_print_int end)
      ;;

      let pp = fun ppf l -> Int_list_pp.pp_list ppf l in
      pp Format.std_formatter [1;2;3] ;;

      module String_list_pp =
        List_printer(struct type t = string let pp = Format.pp_print_string end)
      ;;

      let pp_slist = fun ppf l -> String_list_pp.pp_list ppf l;;
      Format.printf "@[<h>%a@]" pp_slist  ["foo"; "bar"; "bar";] ;;
    #+end_src

** First-order modules

   Modules can also be used as "first-class" values.

   #+begin_src ocaml
     module type COMPARABLE = sig
       type t
       val compare : t -> t -> int
     end
     ;;

     let lmax (type a) (module M:COMPARABLE with type t = a) (l:a list) =
       let rec aux cur_max l =
         match l with
         | [] -> cur_max
         | x :: xs ->
            let cur_max' =
              match cur_max with
              | None -> Some x
              | Some vmax -> if M.compare x vmax > 0 then Some x else cur_max in
            aux cur_max' xs
       in aux None l
     ;;

     module Int = struct
       type t = int ;;
       let compare = Pervasives.compare ;;
     end
     ;;

     lmax (module Int) [1;2;3;] ;;

     (* Module [String] is part of the standard library *)
     lmax (module String) ["foo"; "bar"; "baz";] ;;
   #+end_src

