intro_ocaml.html

<div id="outline-container-org06f8eea" class="outline-4">
<h4 id="org06f8eea"><span class="section-number-4">5.4.2</span> Functors (module generator)</h4>
<div class="outline-text-4" id="text-5-4-2">
<p>
The standard library has functors for sets, maps (tree-based persistent
dictionaries) and hashtables.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">module type</span> <span style="color: #2492db; font-weight: bold;">PRINTABLE</span> = <span style="color: #34495e;">sig</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span>
  <span style="color: #34495e;">val</span> <span style="color: #8e44ad; font-weight: bold;">pp</span>: <span style="color: #2492db; font-weight: bold;">Format.</span>formatter -&gt; t -&gt; unit
<span style="color: #34495e;">end</span>


<span style="color: #34495e;">module</span> <span style="color: #2492db; font-weight: bold;">List_printer</span><span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">X:</span><span style="color: #9b59b6;">PRINTABLE</span><span style="color: #7f8c8d;">)</span><span style="color: #9b59b6;"> </span>= <span style="color: #34495e;">struct</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">printer_func</span> = <span style="color: #2492db; font-weight: bold;">Format.</span>formatter -&gt; unit -&gt; unit

  <span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">pp_list</span>
        ?<span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">pre</span>=<span style="color: #2c3e50;">(</span><span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">ppf</span> <span style="color: #16a085;">()</span> -&gt; <span style="color: #2492db; font-weight: bold;">Format.</span>pp_print_string ppf <span style="color: #27ae60;">"["</span><span style="color: #2c3e50;">)</span><span style="color: #7f8c8d;">)</span>
        ?<span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">post</span>=<span style="color: #2c3e50;">(</span><span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">ppf</span> <span style="color: #16a085;">()</span> -&gt; <span style="color: #2492db; font-weight: bold;">Format.</span>pp_print_string ppf <span style="color: #27ae60;">"]"</span><span style="color: #2c3e50;">)</span><span style="color: #7f8c8d;">)</span>
        ?<span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">sep</span>=<span style="color: #2c3e50;">(</span><span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">ppf</span> <span style="color: #16a085;">()</span> -&gt; <span style="color: #2492db; font-weight: bold;">Format.</span>fprintf ppf <span style="color: #27ae60;">";@ "</span><span style="color: #2c3e50;">)</span><span style="color: #7f8c8d;">)</span>
        <span style="color: #9b59b6;">ppf</span> <span style="color: #9b59b6;">l</span> =
    <span style="color: #34495e;">let</span> <span style="color: #34495e;">open </span><span style="color: #2492db; font-weight: bold;">Format</span> <span style="color: #34495e;">in</span>
    <span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">loop</span> = <span style="color: #2980b9;">function</span>
      | <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span> -&gt; post ppf <span style="color: #7f8c8d;">()</span>
      | e <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> es -&gt;
         <span style="color: #34495e;">begin</span>
           <span style="color: #2492db; font-weight: bold;">X.</span>pp ppf e;
           sep ppf <span style="color: #7f8c8d;">()</span>;
           loop es
         <span style="color: #34495e;">end</span>
    <span style="color: #34495e;">in</span> pre ppf <span style="color: #7f8c8d;">()</span>; loop l
  <span style="color: #ff4500;">;;</span>
<span style="color: #34495e;">end</span>

<span style="color: #34495e;">module</span> <span style="color: #2492db; font-weight: bold;">Int_list_pp</span> =
  <span style="color: #2492db; font-weight: bold;">List_printer</span><span style="color: #7f8c8d;">(</span><span style="color: #34495e;">struct</span> <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> = int <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">pp</span> = <span style="color: #2492db; font-weight: bold;">Format.</span>pp_print_int <span style="color: #34495e;">end</span><span style="color: #7f8c8d;">)</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">pp</span> = <span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">ppf</span> <span style="color: #9b59b6;">l</span> -&gt; <span style="color: #2492db; font-weight: bold;">Int_list_pp.</span>pp_list ppf l <span style="color: #34495e;">in</span>
pp <span style="color: #2492db; font-weight: bold;">Format.</span>std_formatter <span style="color: #7f8c8d;">[</span>1;2;3<span style="color: #7f8c8d;">]</span> <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">module</span> <span style="color: #2492db; font-weight: bold;">String_list_pp</span> =
  <span style="color: #2492db; font-weight: bold;">List_printer</span><span style="color: #7f8c8d;">(</span><span style="color: #34495e;">struct</span> <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> = string <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">pp</span> = <span style="color: #2492db; font-weight: bold;">Format.</span>pp_print_string <span style="color: #34495e;">end</span><span style="color: #7f8c8d;">)</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">pp_slist</span> = <span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">ppf</span> <span style="color: #9b59b6;">l</span> -&gt; <span style="color: #2492db; font-weight: bold;">String_list_pp.</span>pp_list ppf l<span style="color: #ff4500;">;;</span>
<span style="color: #2492db; font-weight: bold;">Format.</span>printf <span style="color: #27ae60;">"@[&lt;h&gt;%a@]"</span> pp_slist  <span style="color: #7f8c8d;">[</span><span style="color: #27ae60;">"foo"</span>; <span style="color: #27ae60;">"bar"</span>; <span style="color: #27ae60;">"bar"</span>;<span style="color: #7f8c8d;">]</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga9cb9d2" class="outline-3">
<h3 id="orga9cb9d2"><span class="section-number-3">5.5</span> First-order modules</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Modules can also be used as "first-class" values.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">module type</span> <span style="color: #2492db; font-weight: bold;">COMPARABLE</span> = <span style="color: #34495e;">sig</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span>
  <span style="color: #34495e;">val</span> <span style="color: #8e44ad; font-weight: bold;">compare</span> : t -&gt; t -&gt; int
<span style="color: #34495e;">end</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">lmax</span> <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">type</span> <span style="color: #9b59b6;">a</span><span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">module</span> <span style="color: #2492db; font-weight: bold;">M</span>:<span style="color: #2492db; font-weight: bold;">COMPARABLE with type t </span>=<span style="color: #2492db; font-weight: bold;"> a</span><span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">l</span>:<span style="color: #9b59b6;">a list</span><span style="color: #7f8c8d;">)</span> =
  <span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">aux</span> <span style="color: #9b59b6;">cur_max</span> <span style="color: #9b59b6;">l</span> =
    <span style="color: #2980b9;">match</span> l <span style="color: #2980b9;">with</span>
    | <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span> -&gt; cur_max
    | x <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> xs -&gt;
       <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">cur_max'</span> =
         <span style="color: #2980b9;">match</span> cur_max <span style="color: #2980b9;">with</span>
         | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">None</span> -&gt; <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Some</span> x
         | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Some</span> vmax -&gt; <span style="color: #2980b9;">if</span> <span style="color: #2492db; font-weight: bold;">M.</span>compare x vmax &gt; 0 <span style="color: #2980b9;">then</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Some</span> x <span style="color: #2980b9;">else</span> cur_max <span style="color: #34495e;">in</span>
       aux cur_max' xs
  <span style="color: #34495e;">in</span> aux <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">None</span> l
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">module</span> <span style="color: #2492db; font-weight: bold;">Int</span> = <span style="color: #34495e;">struct</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> = int <span style="color: #ff4500;">;;</span>
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">compare</span> = <span style="color: #2492db; font-weight: bold;">Pervasives.</span>compare <span style="color: #ff4500;">;;</span>
<span style="color: #34495e;">end</span>
<span style="color: #ff4500;">;;</span>

lmax <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">module</span> <span style="color: #2492db; font-weight: bold;">Int</span><span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">[</span>1;2;3;<span style="color: #7f8c8d;">]</span> <span style="color: #ff4500;">;;</span>

<span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">Module [String] is part of the standard library </span><span style="color: #95a5a6;">*)</span>
lmax <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">module</span> <span style="color: #2492db; font-weight: bold;">String</span><span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">[</span><span style="color: #27ae60;">"foo"</span>; <span style="color: #27ae60;">"bar"</span>; <span style="color: #27ae60;">"baz"</span>;<span style="color: #7f8c8d;">]</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
