intro_ocaml.org
*** More involved example

    #+begin_src ocaml
      type ('var,'cst,'bop,'uop) expr =
        | Var of 'var
        | Cst of 'cst
        | Bop of 'bop * ('var,'cst,'bop,'uop) expr * ('var,'cst,'bop,'uop) expr
        | Uop of 'uop * ('var,'cst,'bop,'uop) expr
      ;;


      module type EXPR = sig
        type var
        type uop
        type cst
        type bop
      end

      module Bool = struct
        type bop =
          | Band
          | Bor
          | Bxor
        ;;

        type uop = Bnot

        type var = string

        type cst = bool
      end


      let free_variables
            (type a b c d)
            (module M:EXPR with type var = a and
                                type cst = b and
                                type bop = c and
                                type uop = d)
            (e:(a,b,c,d) expr) : a list =
        let module S =
          Set.Make(struct type t = M.var let compare = Pervasives.compare end) in
        let rec loop (set:S.t) = function
          | Var v -> S.add v set
          | Cst _ -> set
          | Bop (_, e1, e2) -> S.union (loop set e1) (loop S.empty e2)
          | Uop (_, e) -> loop set e
        in
        let set = loop S.empty e in
        S.fold (fun e l -> e :: l) set []
      ;;

      free_variables (module Bool) (Var "foo") ;;

    #+end_src



** Monadic style programming

   The following type has been making a comeback.

   #+begin_src ocaml
     type ('a, 'b) result =
       | Ok of 'a
       | Error of 'b
     ;;
   #+end_src


   and with it loads of heretofore banished monads :-)

   There is no dedicated notation for working inside monads.

   One usually uses the ~M.bind~ function of monad ~M~ or define an infix
   operator

   #+begin_src ocaml
     let (>>=) = Option.bind ;;

     let hd =
       | [] -> None
       | x :: _ -> Some x

     let sum_heads l1 l2 =
       hd l1 >>=
         fun v1 -> hd l2 >>=
         fun v2 -> v1 + v2
     ;;
   #+end_src

