intro_ocaml.html

<div id="outline-container-org2b4f2a8" class="outline-4">
<h4 id="org2b4f2a8"><span class="section-number-4">5.5.1</span> More involved example</h4>
<div class="outline-text-4" id="text-5-5-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">'var,'cst,'bop,'uop</span><span style="color: #7f8c8d;">)</span><span style="color: #9b59b6;"> expr</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Var</span> <span style="color: #2980b9;">of</span> 'var
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Cst</span> <span style="color: #2980b9;">of</span> 'cst
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bop</span> <span style="color: #2980b9;">of</span> 'bop * <span style="color: #7f8c8d;">(</span>'var,'cst,'bop,'uop<span style="color: #7f8c8d;">)</span> expr * <span style="color: #7f8c8d;">(</span>'var,'cst,'bop,'uop<span style="color: #7f8c8d;">)</span> expr
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Uop</span> <span style="color: #2980b9;">of</span> 'uop * <span style="color: #7f8c8d;">(</span>'var,'cst,'bop,'uop<span style="color: #7f8c8d;">)</span> expr
<span style="color: #ff4500;">;;</span>


<span style="color: #34495e;">module type</span> <span style="color: #2492db; font-weight: bold;">EXPR</span> = <span style="color: #34495e;">sig</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">var</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">uop</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">cst</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">bop</span>
<span style="color: #34495e;">end</span>

<span style="color: #34495e;">module</span> <span style="color: #2492db; font-weight: bold;">Bool</span> = <span style="color: #34495e;">struct</span>
  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">bop</span> =
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Band</span>
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bor</span>
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bxor</span>
  <span style="color: #ff4500;">;;</span>

  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">uop</span> = <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bnot</span>

  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">var</span> = string

  <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">cst</span> = bool
<span style="color: #34495e;">end</span>


<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">free_variables</span>
      <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">type</span> <span style="color: #9b59b6;">a</span> <span style="color: #9b59b6;">b</span> <span style="color: #9b59b6;">c</span> <span style="color: #9b59b6;">d</span><span style="color: #7f8c8d;">)</span>
      <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">module</span> <span style="color: #2492db; font-weight: bold;">M</span>:<span style="color: #2492db; font-weight: bold;">EXPR with type var </span>=<span style="color: #2492db; font-weight: bold;"> a and</span>
<span style="color: #2492db; font-weight: bold;">                          type cst </span>=<span style="color: #2492db; font-weight: bold;"> b and</span>
<span style="color: #2492db; font-weight: bold;">                          type bop </span>=<span style="color: #2492db; font-weight: bold;"> c and</span>
<span style="color: #2492db; font-weight: bold;">                          type uop </span>=<span style="color: #2492db; font-weight: bold;"> d</span><span style="color: #7f8c8d;">)</span>
      <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">e</span>:<span style="color: #2c3e50;">(</span><span style="color: #9b59b6;">a,b,c,d</span><span style="color: #2c3e50;">)</span><span style="color: #9b59b6;"> expr</span><span style="color: #7f8c8d;">)</span> :<span style="color: #9b59b6;"> a list </span>=
  <span style="color: #34495e;">let</span> <span style="color: #34495e;">module</span> <span style="color: #2492db; font-weight: bold;">S</span> =
    <span style="color: #2492db; font-weight: bold;">Set.Make</span><span style="color: #7f8c8d;">(</span><span style="color: #34495e;">struct</span> <span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> = <span style="color: #2492db; font-weight: bold;">M.</span>var <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">compare</span> = <span style="color: #2492db; font-weight: bold;">Pervasives.</span>compare <span style="color: #34495e;">end</span><span style="color: #7f8c8d;">)</span> <span style="color: #34495e;">in</span>
  <span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">loop</span> <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">set</span>:<span style="color: #9b59b6;">S.t</span><span style="color: #7f8c8d;">)</span> = <span style="color: #2980b9;">function</span>
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Var</span> v -&gt; <span style="color: #2492db; font-weight: bold;">S.</span>add v set
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Cst</span> _ -&gt; set
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bop</span> <span style="color: #7f8c8d;">(</span>_, e1, e2<span style="color: #7f8c8d;">)</span> -&gt; <span style="color: #2492db; font-weight: bold;">S.</span>union <span style="color: #7f8c8d;">(</span>loop set e1<span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span>loop <span style="color: #2492db; font-weight: bold;">S.</span>empty e2<span style="color: #7f8c8d;">)</span>
    | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Uop</span> <span style="color: #7f8c8d;">(</span>_, e<span style="color: #7f8c8d;">)</span> -&gt; loop set e
  <span style="color: #34495e;">in</span>
  <span style="color: #34495e;">let</span> <span style="color: #9b59b6;">set</span> = loop <span style="color: #2492db; font-weight: bold;">S.</span>empty e <span style="color: #34495e;">in</span>
  <span style="color: #2492db; font-weight: bold;">S.</span>fold <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">e</span> <span style="color: #9b59b6;">l</span> -&gt; e <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> l<span style="color: #7f8c8d;">)</span> set <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span>
<span style="color: #ff4500;">;;</span>

free_variables <span style="color: #7f8c8d;">(</span><span style="color: #2980b9;">module</span> <span style="color: #2492db; font-weight: bold;">Bool</span><span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span><span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Var</span> <span style="color: #27ae60;">"foo"</span><span style="color: #7f8c8d;">)</span> <span style="color: #ff4500;">;;</span>

</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org8ba4ffd" class="outline-3">
<h3 id="org8ba4ffd"><span class="section-number-3">5.6</span> Monadic style programming</h3>
<div class="outline-text-3" id="text-5-6">
<p>
The following type has been making a comeback.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #7f8c8d;">(</span><span style="color: #9b59b6;">'a, 'b</span><span style="color: #7f8c8d;">)</span><span style="color: #9b59b6;"> result</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ok</span> <span style="color: #2980b9;">of</span> 'a
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Error</span> <span style="color: #2980b9;">of</span> 'b
<span style="color: #ff4500;">;;</span>
</pre>
</div>


<p>
and with it loads of heretofore banished monads :-)
</p>

<p>
There is no dedicated notation for working inside monads.
</p>

<p>
One usually uses the <code>M.bind</code> function of monad <code>M</code> or define an infix
operator
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">let</span> <span style="color: #7f8c8d;">(</span><span style="color: #8e44ad; font-weight: bold;">&gt;&gt;=</span><span style="color: #7f8c8d;">)</span> = <span style="color: #2492db; font-weight: bold;">Option.</span>bind <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">hd</span> =
  | <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span> -&gt; <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">None</span>
  | x <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> _ -&gt; <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Some</span> x

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">sum_heads</span> <span style="color: #9b59b6;">l1</span> <span style="color: #9b59b6;">l2</span> =
  hd l1 &gt;&gt;=
    <span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">v1</span> -&gt; hd l2 &gt;&gt;=
    <span style="color: #2980b9;">fun</span> <span style="color: #9b59b6;">v2</span> -&gt; v1 + v2
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
