intro_ocaml.org
** GADTs

   Generalized Abstract Data Types are available in ~OCaml~ since version
   ~4.00~.

   They are sparsely used

   #+begin_src ocaml
     type arith_bop =
       | Add
       | Mul
       | Div
     ;;

     type arith_uop =
       | UMin
     ;;

     type comparison =
       | Eq
       | Gt
     ;;

     type bool_bop =
       | Bor
       | Band
     ;;

     type bool_uop =
       | Bnot
     ;;

     type _ typ =
       | Int  : int -> int typ
       | Bool : bool -> bool typ
       | Ite  : bool typ * 'a typ * 'a typ -> 'a typ
       | Bar  : arith_bop * int typ * int typ -> int typ
       | Uar  : arith_uop * int typ -> int typ
       | Cmp  : comparison * 'a typ * 'a typ -> bool typ
       | Bbo  : bool_bop * bool typ * bool typ -> bool typ
       | Ubo  : bool_uop * bool typ -> bool typ
     ;;


     let term = Ite ( Cmp (Eq, Int 3, Int 4), Int 12, Int 11) ;;

     let term2 = Ite ( Cmp (Eq, Int 3, Int), Bool true, Bool false) ;;

     let eval_abop = function
       | Add -> ( + )
       | Mul -> ( * )
       | Div -> ( / )

     let eval_cmp = function
       | Eq -> ( = )
       | Gt -> ( > )

     let eval_bbop = function
       | Bor -> ( || )
       | Band -> ( && )

     let rec eval: type a. a typ -> a  = function
       | Int n -> n
       | Bool b -> b
       | Ite (b, ethen, eelse) -> if eval b then eval ethen else eval eelse
       | Bar (op, e1, e2) -> (eval_abop op) (eval e1) (eval e2)
       | Uar (UMin, e) -> - (eval e)
       | Cmp (op, e1, e2) -> (eval_cmp op) (eval e1) (eval e2)
       | Bbo (op, e1, e2) -> (eval_bbop op) (eval e1) (eval e2)
       | Ubo (Bnot, e) -> not (eval e)
     ;;

     eval term ;;

     eval term2 ;;
   #+end_src



