intro_ocaml.html

<div id="outline-container-org7f04004" class="outline-3">
<h3 id="org7f04004"><span class="section-number-3">5.7</span> GADTs</h3>
<div class="outline-text-3" id="text-5-7">
<p>
Generalized Abstract Data Types are available in <code>OCaml</code> since version
<code>4.00</code>.
</p>

<p>
They are sparsely used
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #9b59b6;">arith_bop</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Add</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Mul</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Div</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">type</span> <span style="color: #9b59b6;">arith_uop</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">UMin</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">type</span> <span style="color: #9b59b6;">comparison</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Eq</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Gt</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">type</span> <span style="color: #9b59b6;">bool_bop</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bor</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Band</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">type</span> <span style="color: #9b59b6;">bool_uop</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bnot</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">type</span> <span style="color: #9b59b6;">_ typ</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span>  : int -&gt; int typ
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bool</span> : bool -&gt; bool typ
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ite</span>  : bool typ * 'a typ * 'a typ -&gt; 'a typ
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bar</span>  : arith_bop * int typ * int typ -&gt; int typ
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Uar</span>  : arith_uop * int typ -&gt; int typ
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Cmp</span>  : comparison * 'a typ * 'a typ -&gt; bool typ
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bbo</span>  : bool_bop * bool typ * bool typ -&gt; bool typ
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ubo</span>  : bool_uop * bool typ -&gt; bool typ
<span style="color: #ff4500;">;;</span>


<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">term</span> = <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ite</span> <span style="color: #7f8c8d;">(</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Cmp</span> <span style="color: #2c3e50;">(</span><span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Eq</span>, <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span> 3, <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span> 4<span style="color: #2c3e50;">)</span>, <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span> 12, <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span> 11<span style="color: #7f8c8d;">)</span> <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">term2</span> = <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ite</span> <span style="color: #7f8c8d;">(</span> <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Cmp</span> <span style="color: #2c3e50;">(</span><span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Eq</span>, <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span> 3, <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span><span style="color: #2c3e50;">)</span>, <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bool</span> <span style="color: #d35400;">true</span>, <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bool</span> <span style="color: #d35400;">false</span><span style="color: #7f8c8d;">)</span> <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">eval_abop</span> = <span style="color: #2980b9;">function</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Add</span> -&gt; <span style="color: #7f8c8d;">(</span> <span style="color: #8e44ad; font-weight: bold;">+</span> <span style="color: #7f8c8d;">)</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Mul</span> -&gt; <span style="color: #7f8c8d;">(</span> <span style="color: #8e44ad; font-weight: bold;">*</span> <span style="color: #7f8c8d;">)</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Div</span> -&gt; <span style="color: #7f8c8d;">(</span> <span style="color: #8e44ad; font-weight: bold;">/</span> <span style="color: #7f8c8d;">)</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">eval_cmp</span> = <span style="color: #2980b9;">function</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Eq</span> -&gt; <span style="color: #7f8c8d;">(</span> <span style="color: #8e44ad; font-weight: bold;">=</span> <span style="color: #7f8c8d;">)</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Gt</span> -&gt; <span style="color: #7f8c8d;">(</span> <span style="color: #8e44ad; font-weight: bold;">&gt;</span> <span style="color: #7f8c8d;">)</span>

<span style="color: #34495e;">let</span> <span style="color: #8e44ad; font-weight: bold;">eval_bbop</span> = <span style="color: #2980b9;">function</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bor</span> -&gt; <span style="color: #7f8c8d;">(</span> <span style="color: #8e44ad; font-weight: bold;">||</span> <span style="color: #7f8c8d;">)</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Band</span> -&gt; <span style="color: #7f8c8d;">(</span> <span style="color: #8e44ad; font-weight: bold;">&amp;&amp;</span> <span style="color: #7f8c8d;">)</span>

<span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">eval</span>:<span style="color: #9b59b6;"> </span><span style="color: #2980b9;">type</span><span style="color: #9b59b6;"> a. a typ -&gt; a  </span>= <span style="color: #2980b9;">function</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span> n -&gt; n
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bool</span> b -&gt; b
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ite</span> <span style="color: #7f8c8d;">(</span>b, ethen, eelse<span style="color: #7f8c8d;">)</span> -&gt; <span style="color: #2980b9;">if</span> eval b <span style="color: #2980b9;">then</span> eval ethen <span style="color: #2980b9;">else</span> eval eelse
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bar</span> <span style="color: #7f8c8d;">(</span>op, e1, e2<span style="color: #7f8c8d;">)</span> -&gt; <span style="color: #7f8c8d;">(</span>eval_abop op<span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span>eval e1<span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span>eval e2<span style="color: #7f8c8d;">)</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Uar</span> <span style="color: #7f8c8d;">(</span><span style="color: #34495e; background-color: #ffffff; font-weight: bold;">UMin</span>, e<span style="color: #7f8c8d;">)</span> -&gt; - <span style="color: #7f8c8d;">(</span>eval e<span style="color: #7f8c8d;">)</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Cmp</span> <span style="color: #7f8c8d;">(</span>op, e1, e2<span style="color: #7f8c8d;">)</span> -&gt; <span style="color: #7f8c8d;">(</span>eval_cmp op<span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span>eval e1<span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span>eval e2<span style="color: #7f8c8d;">)</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bbo</span> <span style="color: #7f8c8d;">(</span>op, e1, e2<span style="color: #7f8c8d;">)</span> -&gt; <span style="color: #7f8c8d;">(</span>eval_bbop op<span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span>eval e1<span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">(</span>eval e2<span style="color: #7f8c8d;">)</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Ubo</span> <span style="color: #7f8c8d;">(</span><span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Bnot</span>, e<span style="color: #7f8c8d;">)</span> -&gt; <span style="color: #c0392b;">not</span> <span style="color: #7f8c8d;">(</span>eval e<span style="color: #7f8c8d;">)</span>
<span style="color: #ff4500;">;;</span>

eval term <span style="color: #ff4500;">;;</span>

eval term2 <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
