intro_ocaml.org
** Death by GADTs

   With great expressiveness comes great unreadability ;-)

   #+begin_src ocaml
     (* in tdlib/camlinternalFormatBasics.ml *)
     and ('a1, 'b1, 'c1, 'd1, 'e1, 'f1,
          'a2, 'b2, 'c2, 'd2, 'e2, 'f2) fmtty_rel =
       | Char_ty :                                                 (* %c  *)
           ('a1, 'b1, 'c1, 'd1, 'e1, 'f1,
            'a2, 'b2, 'c2, 'd2, 'e2, 'f2) fmtty_rel ->
           (char -> 'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
            char -> 'a2, 'b2, 'c2, 'd2, 'e2, 'f2) fmtty_rel
       | String_ty :                                               (* %s  *)
           ('a1, 'b1, 'c1, 'd1, 'e1, 'f1,
            'a2, 'b2, 'c2, 'd2, 'e2, 'f2) fmtty_rel ->
           (string -> 'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
            string -> 'a2, 'b2, 'c2, 'd2, 'e2, 'f2) fmtty_rel
       | Int_ty :                                                  (* %d  *)
           ('a1, 'b1, 'c1, 'd1, 'e1, 'f1,
            'a2, 'b2, 'c2, 'd2, 'e2, 'f2) fmtty_rel ->
           (int -> 'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
            int -> 'a2, 'b2, 'c2, 'd2, 'e2, 'f2) fmtty_rel
       | Int32_ty :                                                (* %ld *)
           ('a1, 'b1, 'c1, 'd1, 'e1, 'f1,
            'a2, 'b2, 'c2, 'd2, 'e2, 'f2) fmtty_rel ->
           (int32 -> 'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
            int32 -> 'a2, 'b2, 'c2, 'd2, 'e2, 'f2) fmtty_rel
#+end_src

#+begin_src ocaml
     (* same file *)
     let rec erase_rel : type a b c d e f g h i j k l .
       (a, b, c, d, e, f,
        g, h, i, j, k, l) fmtty_rel -> (a, b, c, d, e, f) fmtty
   #+end_src

** ~Format~'ing text

   The ~Format~ module is a nice ~printf~-like pretty-printing facility
   available in the standard library. This helps outputting structured data in a
   good-looking way.

   A ~Format~-ted output mixes *boxes* and *break hints* to structure your output.

   3 salient elements to think about
   - ~Format.fprintf~
   - the formatter abstraction
   - ~%a~ : chaining pretty printers


   #+begin_src ocaml
     type t =
       | Int of int
       | Add of t * t
     ;;

     open Format ;;

     let rec pp_expr ppf = function
       | Int n -> fprintf ppf "%i" n
       | Add (e1, e2) ->
          fprintf ppf "@[%a@ +@ %a@]"
            pp_expression e1
            pp_expression e2

     and pp_expression ppf =
       fprintf ppf "@[%a@]" pp_expr
     ;;


     let rec addition_list = function
       | [] -> assert false
       | [n] -> Int n
       | x :: xs -> Add (Int x, addition_list xs)
     ;;


     let al =
       List.map (( + ) max_int) [1;2;3;4;5;6;7;]
       |> addition_list
     ;;


     Format.printf "%a@." pp_expr al;;
   #+end_src



   For more:
   - https://hal.archives-ouvertes.fr/hal-01503081/file/format-unraveled.pdf


** Things that I did not talk about

   - Polymorphic variants

     See http://www.yakobowski.org/publis/2008/jfla08.pdf (in French)

   - Low-level representation

     https://v1.realworldocaml.org/v1/en/html/memory-representation-of-values.html

   - Objects
   - PPX syntax extensions (deriving, sexp, ...)
   - Ecosystem (parsing, JSONing, SMTing, ...)




* Conclusion

   ~OCaml~ is *not* a language somehow stuck into a transformation to
   ~Haskell~.It follows different design choices, in the lineage of ML and SML.

  Is there something that is missing ?






#  LocalWords:  polymorphism Genericity hashtables
