intro_ocaml.html



<div id="outline-container-org8cdfb5a" class="outline-3">
<h3 id="org8cdfb5a"><span class="section-number-3">5.8</span> Death by GADTs</h3>
<div class="outline-text-3" id="text-5-8">
<p>
With great expressiveness comes great unreadability ;-)
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">in tdlib/camlinternalFormatBasics.ml </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">and</span> <span style="color: #7f8c8d;">(</span>'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
     'a2, 'b2, 'c2, 'd2, 'e2, 'f2<span style="color: #7f8c8d;">)</span> <span style="color: #9b59b6;">fmtty_rel</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Char_ty</span> :                                                 <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">%c  </span><span style="color: #95a5a6;">*)</span>
      <span style="color: #7f8c8d;">(</span>'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
       'a2, 'b2, 'c2, 'd2, 'e2, 'f2<span style="color: #7f8c8d;">)</span> fmtty_rel -&gt;
      <span style="color: #7f8c8d;">(</span>char -&gt; 'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
       char -&gt; 'a2, 'b2, 'c2, 'd2, 'e2, 'f2<span style="color: #7f8c8d;">)</span> fmtty_rel
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">String_ty</span> :                                               <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">%s  </span><span style="color: #95a5a6;">*)</span>
      <span style="color: #7f8c8d;">(</span>'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
       'a2, 'b2, 'c2, 'd2, 'e2, 'f2<span style="color: #7f8c8d;">)</span> fmtty_rel -&gt;
      <span style="color: #7f8c8d;">(</span>string -&gt; 'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
       string -&gt; 'a2, 'b2, 'c2, 'd2, 'e2, 'f2<span style="color: #7f8c8d;">)</span> fmtty_rel
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int_ty</span> :                                                  <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">%d  </span><span style="color: #95a5a6;">*)</span>
      <span style="color: #7f8c8d;">(</span>'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
       'a2, 'b2, 'c2, 'd2, 'e2, 'f2<span style="color: #7f8c8d;">)</span> fmtty_rel -&gt;
      <span style="color: #7f8c8d;">(</span>int -&gt; 'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
       int -&gt; 'a2, 'b2, 'c2, 'd2, 'e2, 'f2<span style="color: #7f8c8d;">)</span> fmtty_rel
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int32_ty</span> :                                                <span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">%ld </span><span style="color: #95a5a6;">*)</span>
      <span style="color: #7f8c8d;">(</span>'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
       'a2, 'b2, 'c2, 'd2, 'e2, 'f2<span style="color: #7f8c8d;">)</span> fmtty_rel -&gt;
      <span style="color: #7f8c8d;">(</span>int32 -&gt; 'a1, 'b1, 'c1, 'd1, 'e1, 'f1,
       int32 -&gt; 'a2, 'b2, 'c2, 'd2, 'e2, 'f2<span style="color: #7f8c8d;">)</span> fmtty_rel
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #95a5a6;">(* </span><span style="color: #95a5a6; font-style: italic;">same file </span><span style="color: #95a5a6;">*)</span>
<span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #9b59b6;">erase_rel</span> : <span style="color: #2980b9;">type</span> <span style="color: #9b59b6;">a</span> b c d e f g h i j k l .
  <span style="color: #7f8c8d;">(</span>a, b, c, d, e, f,
   g, h, i, j, k, l<span style="color: #7f8c8d;">)</span> fmtty_rel -&gt; <span style="color: #7f8c8d;">(</span>a, b, c, d, e, f<span style="color: #7f8c8d;">)</span> fmtty
</pre>
</div>
</div>
</div>

<div id="outline-container-org55d1d8d" class="outline-3">
<h3 id="org55d1d8d"><span class="section-number-3">5.9</span> <code>Format</code>'ing text</h3>
<div class="outline-text-3" id="text-5-9">
<p>
The <code>Format</code> module is a nice <code>printf</code>-like pretty-printing facility
available in the standard library. This helps outputting structured data in a
good-looking way.
</p>

<p>
A <code>Format</code>-ted output mixes <b>boxes</b> and <b>break hints</b> to structure your output.
</p>

<p>
3 salient elements to think about
</p>
<ul class="org-ul">
<li><code>Format.fprintf</code></li>
<li>the formatter abstraction</li>
<li><code>%a</code> : chaining pretty printers</li>
</ul>


<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #34495e;">type</span> <span style="color: #9b59b6;">t</span> =
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span> <span style="color: #2980b9;">of</span> int
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Add</span> <span style="color: #2980b9;">of</span> t * t
<span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">open </span><span style="color: #2492db; font-weight: bold;">Format</span> <span style="color: #ff4500;">;;</span>

<span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">pp_expr</span> <span style="color: #9b59b6;">ppf</span> = <span style="color: #2980b9;">function</span>
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span> n -&gt; fprintf ppf <span style="color: #27ae60;">"%i"</span> n
  | <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Add</span> <span style="color: #7f8c8d;">(</span>e1, e2<span style="color: #7f8c8d;">)</span> -&gt;
     fprintf ppf <span style="color: #27ae60;">"@[%a@ +@ %a@]"</span>
       pp_expression e1
       pp_expression e2

<span style="color: #34495e;">and</span> <span style="color: #8e44ad; font-weight: bold;">pp_expression</span> <span style="color: #9b59b6;">ppf</span> =
  fprintf ppf <span style="color: #27ae60;">"@[%a@]"</span> pp_expr
<span style="color: #ff4500;">;;</span>


<span style="color: #34495e;">let</span> <span style="color: #34495e;">rec</span> <span style="color: #8e44ad; font-weight: bold;">addition_list</span> = <span style="color: #2980b9;">function</span>
  | <span style="color: #7f8c8d; background-color: #ffffff; font-weight: bold;">[]</span> -&gt; <span style="color: #2980b9;">assert</span> <span style="color: #d35400;">false</span>
  | <span style="color: #7f8c8d;">[</span>n<span style="color: #7f8c8d;">]</span> -&gt; <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span> n
  | x <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">::</span> xs -&gt; <span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Add</span> <span style="color: #7f8c8d;">(</span><span style="color: #34495e; background-color: #ffffff; font-weight: bold;">Int</span> x, addition_list xs<span style="color: #7f8c8d;">)</span>
<span style="color: #ff4500;">;;</span>


<span style="color: #34495e;">let</span> <span style="color: #9b59b6;">al</span> =
  <span style="color: #2492db; font-weight: bold;">List.</span>map <span style="color: #7f8c8d;">(</span><span style="color: #2c3e50;">(</span> <span style="color: #8e44ad; font-weight: bold;">+</span> <span style="color: #2c3e50;">)</span> max_int<span style="color: #7f8c8d;">)</span> <span style="color: #7f8c8d;">[</span>1;2;3;4;5;6;7;<span style="color: #7f8c8d;">]</span>
  <span style="color: #c0392b;">|&gt;</span> addition_list
<span style="color: #ff4500;">;;</span>


<span style="color: #2492db; font-weight: bold;">Format.</span>printf <span style="color: #27ae60;">"%a@."</span> pp_expr al<span style="color: #ff4500;">;;</span>
</pre>
</div>



<p>
For more:
</p>
<ul class="org-ul">
<li><a href="https://hal.archives-ouvertes.fr/hal-01503081/file/format-unraveled.pdf">https://hal.archives-ouvertes.fr/hal-01503081/file/format-unraveled.pdf</a></li>
</ul>
</div>
</div>


<div id="outline-container-orga7427fe" class="outline-3">
<h3 id="orga7427fe"><span class="section-number-3">5.10</span> Things that I did not talk about</h3>
<div class="outline-text-3" id="text-5-10">
<ul class="org-ul">
<li><p>
Polymorphic variants
</p>

<p>
See <a href="http://www.yakobowski.org/publis/2008/jfla08.pdf">http://www.yakobowski.org/publis/2008/jfla08.pdf</a> (in French)
</p></li>

<li><p>
Low-level representation
</p>

<p>
<a href="https://v1.realworldocaml.org/v1/en/html/memory-representation-of-values.html">https://v1.realworldocaml.org/v1/en/html/memory-representation-of-values.html</a>
</p></li>

<li>Objects</li>
<li>PPX syntax extensions (deriving, sexp, &#x2026;)</li>
<li>Ecosystem (parsing, JSONing, SMTing, &#x2026;)</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgbe525c6" class="outline-2">
<h2 id="orgbe525c6"><span class="section-number-2">6</span> Conclusion</h2>
<div class="outline-text-2" id="text-6">
<p>
<code>OCaml</code> is <b>not</b> a language somehow stuck into a transformation to
<code>Haskell</code>.It follows different design choices, in the lineage of ML and SML.
</p>

<p>
Is there something that is missing ?
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 20200109</p>
<p class="author">Author: Richard Bonichon</p>
<p class="date">Created: 2020-01-08 Wed 16:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
